[
  {
    "title": "Magnetic Resonance Technologist",
    "company": "Intermountain Health",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T09:00:00.000Z",
    "description": "Job Responsibilities\nAs an MRI Technologist at Intermountain Health, you will be responsible for operating magnetic resonance scanners to obtain diagnostic images. You will work closely with physicians to complete exams, position patients, and administer contrast agents when necessary. Your expertise in imaging techniques and protocols will ensure accurate diagnoses and excellent patient care.",
    "url": "https://us.bebee.com/job/dd4251637efba6e9914a60a0347f1084?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist - (MRI Tech)",
    "company": "AMN Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793406",
    "description": "About the position\n\nThe MRI Technologist position at AMN Healthcare is an exciting opportunity for a highly motivated and energetic individual to join a well-respected hospital team. The ideal candidate will be responsible for performing magnetic resonance imaging (MRI) procedures, ensuring high-quality images are obtained for diagnostic purposes. This role requires a commitment to maintaining a friendly, positive, and professional environment while providing exceptional patient care. The MRI Technologist will work closely with radiologists and other healthcare professionals to ensure that all imaging protocols are followed and that patient safety is prioritized. The position offers a chance to work in a dynamic healthcare setting in Denver, known for its beautiful Rocky Mountain backdrop and vibrant city life. With over 300 days of sunshine a year, Denver is an attractive location for outdoor enthusiasts, making it an ideal place for travel healthcare professionals.\n\nResponsibilities\n• Perform MRI procedures according to established protocols and standards.\n,\n• Ensure patient safety and comfort during MRI examinations.\n,\n• Maintain and operate MRI equipment effectively and safely.\n,\n• Collaborate with radiologists and healthcare team members to provide quality patient care.\n,\n• Document and maintain accurate patient records and imaging results.\n,\n• Assist in the training and orientation of new staff as needed.\n\nRequirements\n• 2+ years of experience as an MRI Technologist.\n,\n• ARRT certification in MRI.\n,\n• Experience with GE MRI equipment is preferred.\n\nNice-to-haves\n• Experience in a hospital setting.\n,\n• Strong communication and interpersonal skills.\n\nBenefits\n• Competitive pay rates\n,\n• Medical, Dental, Vision insurance\n,\n• 401(k) and Flexible Spending Account\n,\n• Life Insurance\n,\n• Accident and Short-term Disability Coverage\n,\n• Free Continuing Education\n,\n• Competitive Housing Deal\n,\n• Referral bonuses for referring friends.",
    "url": "https://www.tealhq.com/job/mri-technologist-mri-tech_53332245-ba5e-441a-ab7b-c348de70aace?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist Lead",
    "company": "UCHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793400",
    "description": "Location: UCHealth Cherry Creek MOB and ASC, US:CO:Denver\n\nDepartment: UIS Cherry Creek MRI\n\nFTE: Full Time, 1.0, 80.00 hours per pay period (2 weeks)\n\nShift: Days\n\nPay: $41.43 - $62.15 / hour. Pay is dependent on applicant's relevant experience\n\nMinimum Requirements:\n• Graduate of an accredited Radiologic Technologist program.\n• Registered as a Technologist (RT) and certified in magnetic resonance imaging (MRI) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n• Basic Life Support (BLS) Healthcare Provider; BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\n• 2 years of experience.\n\nAt UCHealth, We Improve Lives\n\nPicture yourself on a dynamic team improving lives in the following way(s):\n• Provides top of scope practice in direct patient care\n• Values a multidisciplinary team approach to achieve exceptional outcomes\n• Models proficiency through precepting those new to UCHealth\n• Welcomes new knowledge in a fast paced, innovative clinical environment\n• Contributes to secure safety and quality at the point of care\n\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\n\nUCHealth invests in its Workforce.\n\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\n\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n• Medical, dental and vision coverage including coverage for eligible dependents\n• 403(b) with employer matching contributions\n• Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n• Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n• Employer paid short term disability and long-term disability with buy-up coverage options\n• Wellness benefits\n• Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n• Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\n\nLoan Repayment:\n• UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\n\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\n\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\n\nWho We Are (uchealth.org)",
    "url": "https://www.indeed.com/viewjob?jk=9baa92500222ca33&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Magnetic Resonance Imaging Technologist (MRI Tech) - Weekday Night Shift",
    "company": "Denver Health",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793396",
    "description": "About the position\n\nThe Magnetic Resonance Imaging Technologist (MRI Tech) position at Denver Health is a full-time role focused on performing high-quality MRI examinations under the direction of a radiologist. This position requires a motivated individual who can work independently, demonstrating technical skills and a commitment to patient safety. The MRI Tech will be responsible for selecting specific software parameters to produce quality images that assist physicians in diagnosing patients. The role involves obtaining protocols from radiologists and ensuring compliance with defined image sequences. In addition to technical imaging studies, the MRI Tech will interact with Denver Health's PACS system, handling data entry, image post-processing, archiving tasks, and quality assurance. The technologist will also prepare and administer contrast media for patient examinations, ensuring the correct type and size of IV catheter is used, and must be certified in CPR to manage any potential contrast reactions. Patient safety is paramount; therefore, the MRI Tech will screen patients and visitors to ensure no contraindications exist for MRI examinations. The role includes maintaining patient comfort and dignity, transporting patients as needed, and assisting in the maintenance of department inventory. The technologist will verify physician orders and relevant patient history in Epic, consult with radiologists for imaging protocols, and ensure timely transmission of images to the PACS. The MRI Tech will also be responsible for maintaining imaging equipment, documenting all cleaning and testing results, and notifying supervisory staff of any equipment malfunctions. Accurate documentation of patient information is essential to comply with screening, ordering, and medical record requirements. This position is critical in providing high-quality imaging services and supporting the overall mission of Denver Health.\n\nResponsibilities\n• Perform high quality MRI imaging studies by selecting specific software parameters to produce quality images for diagnosis.\n,\n• Interact effectively with Denver Health's PACS system, including data entry, image post-processing, and quality assurance tasks.\n,\n• Prepare and administer contrast media for patient examinations according to radiologists' direction, ensuring proper IV catheter use.\n,\n• Screen patients and visitors to ensure safety and verify that contraindications do not exist for MRI examinations.\n,\n• Ensure patient safety, comfort, and dignity by following appropriate care guidelines and transporting patients as needed.\n,\n• Assist in maintaining department inventory by ordering, stocking, and performing inventory checks on medical supplies.\n,\n• Verify physician orders and relevant patient history in Epic, consulting with radiologists for imaging protocols.\n,\n• Scan relevant clinical information into the PACS and transmit images to the PACS immediately after examinations.\n,\n• Maintain imaging equipment by performing scheduled cleanings and tests, documenting results, and notifying staff of malfunctions.\n,\n• Document all pertinent patient information to comply with screening, ordering, and medical record requirements.\n\nRequirements\n• Post High School Diploma or Certificate Program Required.\n,\n• 1-3 years of professional work experience in performing radiographic procedures, including 6 months experience in MRI imaging studies.\n,\n• BLS-Basic Life Support (BLS/CPR) certification from AHA required.\n,\n• RTR-RT Radiography certification from ARRT required.\n,\n• Demonstrated knowledge in operating MRI equipment and related technology.\n,\n• Knowledge of age-specific care needs of patients.\n,\n• Demonstrated technical skill sets in performing MRI studies.\n,\n• Interpersonal skills for effective communication and collaboration.\n,\n• Competency in interpreting physician order requests for MRI imaging studies.\n,\n• Ability to exercise prudent judgment in selecting and configuring equipment settings.\n\nNice-to-haves\n• Experience with PACS systems and image quality assurance processes.\n,\n• Additional certifications in MRI technology or related fields.\n\nBenefits\n• Up to 27 paid days off per year.\n,\n• Immediate retirement plan employer contribution up to 9.5%.\n,\n• Generous medical plans.\n,\n• Free RTD EcoPass for public transportation.\n,\n• On-site employee fitness center and wellness classes.\n,\n• Childcare discount programs and exclusive perks on large brands, travel, and more.\n,\n• Tuition reimbursement and assistance.\n,\n• Education and development opportunities including career pathways and coaching.\n,\n• Professional clinical advancement program and shared governance.\n,\n• Public Service Loan Forgiveness (PSLF) eligible employer with free student loan coaching.",
    "url": "https://www.tealhq.com/job/magnetic-resonance-imaging-technologist-mri-tech-weekday-night-shift_e1eadce4-9c1d-463a-9379-b419a2846ab3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Tech - Magnetic Resonance Imaging Technologist - Competitive Comp & Great Benefits",
    "company": "i4 Search Group Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793392",
    "description": "Allied Health MRI Tech Magnetic Resonance Imaging Technologist\n\nPOSITION TYPE: Allied Health\n\nSPECIALTY UNIT: MRI Technologist\n\nLOCATION:West Metro Denver\n\nSHIFT: Variable & Days - Two positions available\n\nJOB TYPE: Full-Time Permanent\n\nJob Summary:\n\nWe are in search of a professional MRI Technologist that will be responsible for coordinating and performing MRI Scans for diagnostic purposes and for providing patient services using applicable imaging modalities.\n\nExplain procedures to patients in laypersons terms and confirm patient understanding.\n\nEnsure patient comfort and safety for the duration of the appointment.\n\nPrepare, position, and immobilize patients before conducting scans.\n\nPerform radiologic tests to obtain clear and correct body scans.\n\nPerform highly complex examinations and general diagnostic procedures.\n\nMonitor patients throughout procedures.\n\nFollow all radiological safety procedures and guidelines.\n\nJob Benefits:\n\nCompetitive salary\n\nDirect Deposit\n\n401K\n\nComprehensive Health, Dental, and Vision benefits\n\nEmployee discount program\n\nExcellent room for growth and advancement\n\nPaid Family Leave\n\nAnd much more\n\nRequirements:\n\nMRI Experience preferred.New Grads will be considered as well.\n\nRequired Must be registered by the (ARRT) American Registry of Radiologic Technology in MRI(MR) and/or R.T.(R).\n\nAssociates Degree preferred.\n\nActive BLS certification from American Heart Association required.",
    "url": "https://www.ziprecruiter.com/c/i4-Search-Group-Healthcare/Job/MRI-Tech-Magnetic-Resonance-Imaging-Technologist-Competitive-Comp-&-Great-Benefits/-in-Denver,CO?jid=5f040cb1ffa1522a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Tech - Magnetic Resonance Imaging Technologist - Competitive Comp & Great Benefits",
    "company": "i4 Search Group Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793388",
    "description": "Allied Health MRI Tech Magnetic Resonance Imaging Technologist\n\nPOSITION TYPE: Allied Health\n\nSPECIALTY UNIT: MRI Technologist\n\nLOCATION:West Metro Denver\n\nSHIFT: Variable & Days - Two positions available\n\nJOB TYPE: Full-Time Permanent\n\nJob Summary:\n\nWe are in search of a professional MRI Technologist that will be responsible for coordinating and performing MRI Scans for diagnostic purposes and for providing patient services using applicable imaging modalities.\n\nExplain procedures to patients in laypersons terms and confirm patient understanding.\n\nEnsure patient comfort and safety for the duration of the appointment.\n\nPrepare, position, and immobilize patients before conducting scans.\n\nPerform radiologic tests to obtain clear and correct body scans.\n\nPerform highly complex examinations and general diagnostic procedures.\n\nMonitor patients throughout procedures.\n\nFollow all radiological safety procedures and guidelines.\n\nJob Benefits:\n\nCompetitive salary\n\nDirect Deposit\n\n401K\n\nComprehensive Health, Dental, and Vision benefits\n\nEmployee discount program\n\nExcellent room for growth and advancement\n\nPaid Family Leave\n\nAnd much more\n\nRequirements:\n\nMRI Experience preferred.New Grads will be considered as well.\n\nRequired Must be registered by the (ARRT) American Registry of Radiologic Technology in MRI(MR) and/or R.T.(R).\n\nAssociates Degree preferred.\n\nActive BLS certification from American Heart Association required.",
    "url": "https://www.ziprecruiter.com/c/i4-Search-Group-Healthcare/Job/MRI-Tech-Magnetic-Resonance-Imaging-Technologist-Competitive-Comp-&-Great-Benefits/-in-Denver,CO?jid=5f040cb1ffa1522a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Float MRI Technologist",
    "company": "Touchstone Medical Imaging",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793383",
    "description": "US Radiology is one of the largest and most progressive radiology groups in the country. Our mission is to make the best of radiology better to improve lives. With over 5,000 team members and over 175 outpatient imaging centers across 13 states, our team conducts nearly 8 million studies annually. US Radiology is a partnership of leading sub-specialized radiology groups, high-quality imaging centers and health systems built around a commitment to best-in-class clinical excellence, operations, infrastructure, and state-of-the-art technology.\n\nNO HOLIDAYS NO OVERNIGHT SHIFTS MONTHLY BONUSES\nWe are looking for a full time Float MRI Technologist for our Denver, CO location. This is a fulltime position with benefits and schedules will be provided with notice.\n• Premium pay and shift differential\n• Bonus monthly off each center you provide coverage for\n• Mileage reimbursement\n\nRequirements\n• Graduate of an accredited school of radiologic technology.\n• Advanced registry in MRI required - ARRT (MR) or ARMRIT certification\n• Experience working in a MRI Technologist position\n• Demonstrate an adequate knowledge of anatomy\n• CPR Certification is required\n• IV Skills required\n\nDesired Skills\n• Customer service skills\n• Time Management/Organized\n• Extrovert\n• Patience\n• Versatility to juggle multiple tasks\n\nOur benefits package includes:\n• Medical / Dental / Vision / Life / Pharmacy Plans\n• 401(k)\n• Paid Short-Term Disability\n• Paid Vacation Time\n• PTO Accrual Beginning Day 1\n• Colleague Referral Bonus Program\n\n#TMIJ\n\nU.S. Radiology Specialists is an equal opportunity at will employer and does not discriminate against any employee or applicant for employment because of age, race, religion, color, disability, sex, sexual orientation or national origin.",
    "url": "https://www.indeed.com/viewjob?jk=0de261b7eee537fa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist - (MRI Tech)",
    "company": "AMN Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793378",
    "description": "About the position\n\nThe MRI Technologist position at AMN Healthcare is an exciting opportunity for a highly motivated and energetic individual to join a well-respected hospital team. The ideal candidate will be responsible for performing magnetic resonance imaging (MRI) procedures, ensuring high-quality images are obtained for diagnostic purposes. This role requires a commitment to maintaining a friendly, positive, and professional environment while providing exceptional patient care. The MRI Technologist will work closely with radiologists and other healthcare professionals to ensure that all imaging protocols are followed and that patient safety is prioritized. The position offers a chance to work in a dynamic healthcare setting in Denver, known for its beautiful Rocky Mountain backdrop and vibrant city life. With over 300 days of sunshine a year, Denver is an attractive location for outdoor enthusiasts, making it an ideal place for travel healthcare professionals.\n\nResponsibilities\n• Perform MRI procedures according to established protocols and standards.\n,\n• Ensure patient safety and comfort during MRI examinations.\n,\n• Maintain and operate MRI equipment effectively and safely.\n,\n• Collaborate with radiologists and healthcare team members to provide quality patient care.\n,\n• Document and maintain accurate patient records and imaging results.\n,\n• Assist in the training and orientation of new staff as needed.\n\nRequirements\n• 2+ years of experience as an MRI Technologist.\n,\n• ARRT certification in MRI.\n,\n• Experience with GE MRI equipment is preferred.\n\nNice-to-haves\n• Experience in a hospital setting.\n,\n• Strong communication and interpersonal skills.\n\nBenefits\n• Competitive pay rates\n,\n• Medical, Dental, Vision insurance\n,\n• 401(k) and Flexible Spending Account\n,\n• Life Insurance\n,\n• Accident and Short-term Disability Coverage\n,\n• Free Continuing Education\n,\n• Competitive Housing Deal\n,\n• Referral bonuses for referring friends.",
    "url": "https://www.tealhq.com/job/mri-technologist-mri-tech_53332245-ba5e-441a-ab7b-c348de70aace?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Tech - Magnetic Resonance Imaging Technologist - Competitive Comp & Great Benefits",
    "company": "i4 Search Group Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793374",
    "description": "Allied Health MRI Tech Magnetic Resonance Imaging Technologist\n\nPOSITION TYPE: Allied Health\n\nSPECIALTY UNIT: MRI Technologist\n\nLOCATION:West Metro Denver\n\nSHIFT: Variable & Days - Two positions available\n\nJOB TYPE: Full-Time Permanent\n\nJob Summary:\n\nWe are in search of a professional MRI Technologist that will be responsible for coordinating and performing MRI Scans for diagnostic purposes and for providing patient services using applicable imaging modalities.\n\nExplain procedures to patients in laypersons terms and confirm patient understanding.\n\nEnsure patient comfort and safety for the duration of the appointment.\n\nPrepare, position, and immobilize patients before conducting scans.\n\nPerform radiologic tests to obtain clear and correct body scans.\n\nPerform highly complex examinations and general diagnostic procedures.\n\nMonitor patients throughout procedures.\n\nFollow all radiological safety procedures and guidelines.\n\nJob Benefits:\n\nCompetitive salary\n\nDirect Deposit\n\n401K\n\nComprehensive Health, Dental, and Vision benefits\n\nEmployee discount program\n\nExcellent room for growth and advancement\n\nPaid Family Leave\n\nAnd much more\n\nRequirements:\n\nMRI Experience preferred.New Grads will be considered as well.\n\nRequired Must be registered by the (ARRT) American Registry of Radiologic Technology in MRI(MR) and/or R.T.(R).\n\nAssociates Degree preferred.\n\nActive BLS certification from American Heart Association required.",
    "url": "https://www.ziprecruiter.com/c/i4-Search-Group-Healthcare/Job/MRI-Tech-Magnetic-Resonance-Imaging-Technologist-Competitive-Comp-&-Great-Benefits/-in-Denver,CO?jid=5f040cb1ffa1522a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist Lead",
    "company": "UCHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793370",
    "description": "Location: UCHealth Cherry Creek MOB and ASC, US:CO:Denver\n\nDepartment: UIS Cherry Creek MRI\n\nFTE: Full Time, 1.0, 80.00 hours per pay period (2 weeks)\n\nShift: Days\n\nPay: $41.43 - $62.15 / hour. Pay is dependent on applicant's relevant experience\n\nMinimum Requirements:\n• Graduate of an accredited Radiologic Technologist program.\n• Registered as a Technologist (RT) and certified in magnetic resonance imaging (MRI) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n• Basic Life Support (BLS) Healthcare Provider; BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\n• 2 years of experience.\n\nAt UCHealth, We Improve Lives\n\nPicture yourself on a dynamic team improving lives in the following way(s):\n• Provides top of scope practice in direct patient care\n• Values a multidisciplinary team approach to achieve exceptional outcomes\n• Models proficiency through precepting those new to UCHealth\n• Welcomes new knowledge in a fast paced, innovative clinical environment\n• Contributes to secure safety and quality at the point of care\n\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\n\nUCHealth invests in its Workforce.\n\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\n\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n• Medical, dental and vision coverage including coverage for eligible dependents\n• 403(b) with employer matching contributions\n• Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n• Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n• Employer paid short term disability and long-term disability with buy-up coverage options\n• Wellness benefits\n• Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n• Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\n\nLoan Repayment:\n• UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\n\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\n\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\n\nWho We Are (uchealth.org)",
    "url": "https://www.indeed.com/viewjob?jk=9baa92500222ca33&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist.",
    "company": "Touchstone Medical Imaging.",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793367",
    "description": "We are seeking a full-time Float MRI Technologist for our Denver, CO locations. This position offers a standard schedule of Mon-Fri, 8:30am-5pm, with potential for 10-12 hour shifts. Benefits include:\n• Medical/Dental/Vision/Life/Pharmacy Plans\n• 401(k)\n• Paid Short-Term Disability\n• Paid Vacation Time\n• PTO Accrual Beginning Day 1\n• Colleague Referral Bonus Program\n\nRequirements include graduation from an accredited radiologic technology program, ARRT (MR) or ARMRIT certification, MRI experience, CPR certification, and IV skills. Desired skills include customer service, time management, and versatility. No holidays or overnight shifts, plus monthly bonuses offered.\n\nAbout the Company:\nTouchstone Medical Imaging.",
    "url": "https://www.monster.com/job-openings/mri-technologist-denver-co--6727f6ec-c9c5-423e-8df5-2186c389fa3e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Float MRI Technologist",
    "company": "Touchstone Medical Imaging",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.793356",
    "description": "US Radiology is one of the largest and most progressive radiology groups in the country. Our mission is to make the best of radiology better to improve lives. With over 5,000 team members and over 175 outpatient imaging centers across 13 states, our team conducts nearly 8 million studies annually. US Radiology is a partnership of leading sub-specialized radiology groups, high-quality imaging centers and health systems built around a commitment to best-in-class clinical excellence, operations, infrastructure, and state-of-the-art technology.\n\nNO HOLIDAYS NO OVERNIGHT SHIFTS MONTHLY BONUSES\nWe are looking for a full time Float MRI Technologist for our Denver, CO location. This is a fulltime position with benefits and schedules will be provided with notice.\n• Premium pay and shift differential\n• Bonus monthly off each center you provide coverage for\n• Mileage reimbursement\n\nRequirements\n• Graduate of an accredited school of radiologic technology.\n• Advanced registry in MRI required - ARRT (MR) or ARMRIT certification\n• Experience working in a MRI Technologist position\n• Demonstrate an adequate knowledge of anatomy\n• CPR Certification is required\n• IV Skills required\n\nDesired Skills\n• Customer service skills\n• Time Management/Organized\n• Extrovert\n• Patience\n• Versatility to juggle multiple tasks\n\nOur benefits package includes:\n• Medical / Dental / Vision / Life / Pharmacy Plans\n• 401(k)\n• Paid Short-Term Disability\n• Paid Vacation Time\n• PTO Accrual Beginning Day 1\n• Colleague Referral Bonus Program\n\n#TMIJ\n\nU.S. Radiology Specialists is an equal opportunity at will employer and does not discriminate against any employee or applicant for employment because of age, race, religion, color, disability, sex, sexual orientation or national origin.",
    "url": "https://www.indeed.com/viewjob?jk=0de261b7eee537fa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist - M-F, 4 10s, DAY SHIFT - NO NIGHTS, NO WEEKENDS!",
    "company": "Jobot",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790298",
    "description": "Use our easy apply form to send your application to Jessica Glowacki, the Jobot Pro hosting this job. Compensation Based on Experience.",
    "url": "https://jobot.com/details/ct-technologist-m-f-4-10s-day-shift-no-nights-no-weekends/a1b53cd901?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Radiologic Technologist / CT & General Radiology",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790293",
    "description": "Job Summary:\n\nFunctions in the clinic as both a CT Technologist and a Radiographer. Operates general radiography equipment and computed tomography imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of CT/RT techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Initiates IVs and monitors contrast administration under direct physician supervision. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients and co-workers. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy. Operates CT/Gen Rad equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images. Confers with Radiologist/attending physician to establish requirements for non-standard examinations. Follows all established scanning protocols.\n• Operates and effectively utilizes PACS equipment, including computer operations, digital image transfer, post processing functions and other devices. Processes and transmits images according to established department protocols and standard operating procedures.\n• Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/images obtained, identifying patient demographic information and tracking repeated scanning sequences.\n• Starts IVs and monitors patient during contrast administration under direction of a physician.\n• Maintains quality control of all CT/Gen Rad procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality. Participates in all ACR accreditation requirements as required.\n• Prepares and maintains CT/Gen Rad records and files, as required. Maintains daily log and enters statistics into computer as needed.\n• Monitors and maintains inventory of supplies used in providing CT/Gen Rad services according to established guidelines.\n• Monitors and maintains inventory of supplies used in providing CT/Gen Rad services according to established levels. Maintains equipment and work area in a clean and orderly condition.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy.\n• Exercises clinical judgment within scope of practice.\n• Performs other duties as required.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.",
    "url": "https://www.kaiserpermanentejobs.org/job/denver/radiologic-technologist-ct-and-general-radiology/641/71675123792?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Tech - Full Time - Nights",
    "company": "AdventHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790287",
    "description": "All the benefits and perks you need for you and your family:\n• Sign on Bonus Eligible\n• Benefits from Day One\n• Paid Days Off from Day One\n• Student Loan Repayment Program\n• Career Development\n• Whole Person Wellbeing Resources\n\nOur promise to you:\n\nJoining AdventHealth is about being part of something bigger. It’s about belonging to a community that believes in the wholeness of each person, and serves to uplift others in body, mind, and spirit. AdventHealth is a place where you can thrive professionally, and grow spiritually, by Extending the Healing Ministry of Christ. Where you will be valued for who you are and the unique experiences you bring to our purpose-minded team. All while understanding that together we are even better.\n\nSchedule: Full-time\n\nShift : Nights\n\nLocation: 2525 S DOWNING ST, Denver, 80210\n\nThe role you’ll contribute:\n\nProvide quality patient care to all patients within the medical imaging department. Perform high quality images and exams on patients while maintaining the sensitivity to patient needs. Follows standards of safe radiation practice. Demonstrates leadership abilities and is a role model for other associate technologists. Acts as a clinical resource to unit personnel and assures current standards of practice for the unit.\n\nThe value you’ll bring to the team:\n• Performs diagnostic imaging procedures, providing safety for self, patients, and all other individuals. Practices all rules and regulations pertaining to radiation safety, reducing personal and patient exposure to “as low as reasonably achievable” (ALARA).\n• Produces quality images in a complete, accurate and timely manner.\n• Prepares patient for exam. Provides information and instruction to patient and/or family regarding the procedure and responds to their physical and emotional needs.\n• Assists the patient during exam and positions the patient.\n\nQualifications\n\nThe expertise and experiences you’ll need to succeed:\n• High School Diploma or GED\n• One year of related experience\n• ARRT(CT), ARRT(N), ARRT(T) or CNMT registry required or State CT registry ARRT(R) with CT training.\n• Current Basic Life Support (BLS) from American Heart Association\n• Licensed Radiology Technologist in state of employment if working in a Kansas site.\n\nThis facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances. The salary range reflects the anticipated base pay range for this position. Individual compensation is determined based on skills, experience and other relevant factors within this pay range. The minimums and maximums for each position may vary based on geographical location.\n\nCategory: Radiology/Imaging\n\nOrganization: AdventHealth Porter\n\nSchedule: Full-time\n\nShift: 3 - Night\n\nReq ID: 24039403\n\nWe are an equal opportunity employer and do not tolerate discrimination based on race, color, creed, religion, national origin, sex, marital status, age or disability/handicap with respect to recruitment, selection, placement, promotion, wages, benefits and other terms and conditions of employment.",
    "url": "https://jobs.adventhealth.com/denver-co/ct-tech-full-time-nights/6C2B82CF9D19427591E286A6DF7C894B/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT TECHNICIAN - CT SCANNER",
    "company": "UCHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790282",
    "description": "About the position\n\nThe Radiology Cat Scan position at UCHealth is a full-time role focused on providing high-quality patient care through advanced imaging techniques. The role emphasizes a multidisciplinary team approach to achieve exceptional outcomes and requires proficiency in computed tomography (CT) imaging. The position involves direct patient interaction, ensuring safety and quality in imaging practices, and contributing to the overall patient experience.\n\nResponsibilities\n• Provides top of scope practice in direct patient care.\n,\n• Values a multidisciplinary team approach to achieve exceptional outcomes.\n,\n• Models proficiency through precepting those new to UCHealth.\n,\n• Welcomes new knowledge in a fast-paced, innovative clinical environment.\n,\n• Contributes to secure safety and quality at the point of care.\n,\n• Reviews patient history and initiates Computed Tomography images based on physician orders.\n,\n• Prioritizes procedural patient education to ensure mutual understanding and cooperation.\n,\n• Safely administers contrast media or associated imaging medications while monitoring patient condition.\n,\n• Responds and reports changes in patient condition as appropriate.\n,\n• Implements techniques to yield clarity in image quality control and equipment functionality based on established best practices in Radiology (ARRT).\n,\n• May perform 3-D post processing while entering, transmitting, and reporting scan results.\n\nRequirements\n• Graduate of an accredited Radiologic Technologist program.\n,\n• Registered as a Radiologic Technologist (RT) and registered, or registry eligible with completion of registry in 12 months in computed tomography (CT) by the American Registry of Radiologic Technologists (ARRT).\n,\n• Basic Life Support (BLS) Healthcare Provider certification.\n\nNice-to-haves\n• Experience in a fast-paced clinical environment.\n,\n• Proficiency in 3-D post processing techniques.\n\nBenefits\n• Full medical, dental, and vision coverage.\n,\n• Retirement plans including 403(b) matching.\n,\n• Paid time off (PTO) with initial balance at start of employment.\n,\n• Employer-paid life and disability insurance with additional buy-up coverage options.\n,\n• Tuition and continuing education reimbursement.\n,\n• Wellness benefits.\n,\n• Voluntary benefits such as identity theft protection and pet insurance.\n,\n• Education benefits for employees, including 100% tuition coverage for specific degrees and up to $5,250 in tuition reimbursement each calendar year.\n,\n• Loan Repayment assistance through the federal Public Service Loan Forgiveness (PSLF) program.",
    "url": "https://www.tealhq.com/job/CT-TECHNICIAN---CT-SCANNER_853cd2bb-b074-4f05-9e37-533dc91385d8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technician - Free Standing ER - Full Time",
    "company": "AdventHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790273",
    "description": "All the benefits and perks you need for you and your family:\n• Sign On Bonus Eligible\n• Benefits from Day One\n• Paid Days Off from Day One\n• Student Loan Repayment Program\n• Career Development\n• Whole Person Wellbeing Resources\n\nOur promise to you:\n\nJoining AdventHealth is about being part of something bigger. It’s about belonging to a community that believes in the wholeness of each person, and serves to uplift others in body, mind, and spirit. AdventHealth is a place where you can thrive professionally, and grow spiritually, by Extending the Healing Ministry of Christ. Where you will be valued for who you are and the unique experiences you bring to our purpose-minded team. All while understanding that together we are even better.\n\nSchedule: Full-time\n\nShift : Nights\n\nLocation: 7000 E HAMPDEN AVE, Denver, 80224\n\nThe role you’ll contribute:\n\nProvide quality patient care to all patients within the medical imaging department. Perform high quality images and exams on patients while maintaining the sensitivity to patient needs. Follows standards of safe radiation practice. Demonstrates leadership abilities and is a role model for other associate technologists. Acts as a clinical resource to unit personnel and assures current standards of practice for the unit.\n\nThe value you’ll bring to the team:\n• Performs diagnostic imaging procedures, providing safety for self, patients and all other individuals. Practices all rules and regulations pertaining to radiation safety, reducing personal and patient exposure to “as low as reasonably achievable” (ALARA).\n• Produces quality images in a complete, accurate and timely manner.\n• Prepares patient for exam. Provides information and instruction to patient and/or family regarding the procedure and responds to their physical and emotional needs.\n• Assists the patient during exam and positions the patient.\n\nQualifications\n\nThe expertise and experiences you’ll need to succeed:\n• High School Diploma or GED\n• One year of related experience\n• ARRT(CT), ARRT(N), ARRT(T) or CNMT registry required or State CT registry ARRT(R) with CT training\n• Current Basic Life Support (BLS) from American Heart Association\n• Licensed Radiology Technologist in state of employment if working in a Kansas site\n\nThis facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances. The salary range reflects the anticipated base pay range for this position. Individual compensation is determined based on skills, experience and other relevant factors within this pay range. The minimums and maximums for each position may vary based on geographical location.\n\nCategory: Radiology/Imaging\n\nOrganization: AdventHealth Rocky Mountain\n\nSchedule: Full-time\n\nShift: 3 - Night\n\nReq ID: 24033138\n\nWe are an equal opportunity employer and do not tolerate discrimination based on race, color, creed, religion, national origin, sex, marital status, age or disability/handicap with respect to recruitment, selection, placement, promotion, wages, benefits and other terms and conditions of employment.",
    "url": "https://jobs.adventhealth.com/denver-co/ct-technician-free-standing-er-full-time/9BD6104D553742DCA8EA6DBB238CB676/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist - M-F, 4 10s, DAY SHIFT - NO NIGHTS, NO WEEKENDS!",
    "company": "Jobot",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790270",
    "description": "Use our easy apply form to send your application to Jessica Glowacki, the Jobot Pro hosting this job. Compensation Based on Experience.",
    "url": "https://jobot.com/details/ct-technologist-m-f-4-10s-day-shift-no-nights-no-weekends/a1b53cd901?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Radiologic Technologist / CT & General Radiology",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790261",
    "description": "Job Summary:\n\nFunctions in the clinic as both a CT Technologist and a Radiographer. Operates general radiography equipment and computed tomography imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of CT/RT techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Initiates IVs and monitors contrast administration under direct physician supervision. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients and co-workers. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy. Operates CT/Gen Rad equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images. Confers with Radiologist/attending physician to establish requirements for non-standard examinations. Follows all established scanning protocols.\n• Operates and effectively utilizes PACS equipment, including computer operations, digital image transfer, post processing functions and other devices. Processes and transmits images according to established department protocols and standard operating procedures.\n• Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/images obtained, identifying patient demographic information and tracking repeated scanning sequences.\n• Starts IVs and monitors patient during contrast administration under direction of a physician.\n• Maintains quality control of all CT/Gen Rad procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality. Participates in all ACR accreditation requirements as required.\n• Prepares and maintains CT/Gen Rad records and files, as required. Maintains daily log and enters statistics into computer as needed.\n• Monitors and maintains inventory of supplies used in providing CT/Gen Rad services according to established guidelines.\n• Monitors and maintains inventory of supplies used in providing CT/Gen Rad services according to established levels. Maintains equipment and work area in a clean and orderly condition.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy.\n• Exercises clinical judgment within scope of practice.\n• Performs other duties as required.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.",
    "url": "https://www.kaiserpermanentejobs.org/job/denver/radiologic-technologist-ct-and-general-radiology/641/71675123792?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technician - Free Standing ER - Full Time",
    "company": "AdventHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-05T05:38:04.790248",
    "description": "All the benefits and perks you need for you and your family:\n• Sign On Bonus Eligible\n• Benefits from Day One\n• Paid Days Off from Day One\n• Student Loan Repayment Program\n• Career Development\n• Whole Person Wellbeing Resources\n\nOur promise to you:\n\nJoining AdventHealth is about being part of something bigger. It’s about belonging to a community that believes in the wholeness of each person, and serves to uplift others in body, mind, and spirit. AdventHealth is a place where you can thrive professionally, and grow spiritually, by Extending the Healing Ministry of Christ. Where you will be valued for who you are and the unique experiences you bring to our purpose-minded team. All while understanding that together we are even better.\n\nSchedule: Full-time\n\nShift : Nights\n\nLocation: 7000 E HAMPDEN AVE, Denver, 80224\n\nThe role you’ll contribute:\n\nProvide quality patient care to all patients within the medical imaging department. Perform high quality images and exams on patients while maintaining the sensitivity to patient needs. Follows standards of safe radiation practice. Demonstrates leadership abilities and is a role model for other associate technologists. Acts as a clinical resource to unit personnel and assures current standards of practice for the unit.\n\nThe value you’ll bring to the team:\n• Performs diagnostic imaging procedures, providing safety for self, patients and all other individuals. Practices all rules and regulations pertaining to radiation safety, reducing personal and patient exposure to “as low as reasonably achievable” (ALARA).\n• Produces quality images in a complete, accurate and timely manner.\n• Prepares patient for exam. Provides information and instruction to patient and/or family regarding the procedure and responds to their physical and emotional needs.\n• Assists the patient during exam and positions the patient.\n\nQualifications\n\nThe expertise and experiences you’ll need to succeed:\n• High School Diploma or GED\n• One year of related experience\n• ARRT(CT), ARRT(N), ARRT(T) or CNMT registry required or State CT registry ARRT(R) with CT training\n• Current Basic Life Support (BLS) from American Heart Association\n• Licensed Radiology Technologist in state of employment if working in a Kansas site\n\nThis facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances. The salary range reflects the anticipated base pay range for this position. Individual compensation is determined based on skills, experience and other relevant factors within this pay range. The minimums and maximums for each position may vary based on geographical location.\n\nCategory: Radiology/Imaging\n\nOrganization: AdventHealth Rocky Mountain\n\nSchedule: Full-time\n\nShift: 3 - Night\n\nReq ID: 24033138\n\nWe are an equal opportunity employer and do not tolerate discrimination based on race, color, creed, religion, national origin, sex, marital status, age or disability/handicap with respect to recruitment, selection, placement, promotion, wages, benefits and other terms and conditions of employment.",
    "url": "https://jobs.adventhealth.com/denver-co/ct-technician-free-standing-er-full-time/9BD6104D553742DCA8EA6DBB238CB676/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Healthcare Professional - CT Scan Technician",
    "company": "HealthTrust Workforce Solutions HCA",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-04T22:00:00.000Z",
    "description": "Empowering Healthcare Professionals\n\nAt HealthTrust Workforce Solutions HCA, we believe that healthcare is not just about the four walls of a facility but about the people who provide and receive care. Our focus is on empowering healthcare professionals to deliver exceptional patient experiences by providing them with the necessary skills, tools, and support.\n\nOur Mission\n\nOur mission is to provide quality patient care by partnering with healthcare facilities nationwide to ensure that the right professionals are in the right roles. We prioritize our clinicians by giving them a voice and access to opportunities to fulfill their mission of improving lives.\n\nWhat We Offer\n\n• First-priority access to over 200,000 jobs nationwide\n• Partnership with top-performing hospitals\n• Opportunity to grow your career with us\n\nJob Requirements\n\n• A degree from an accredited school of nursing\n• Minimum 1-year acute care experience in a hospital setting\n• Current State Nursing License\n\nBenefits Package\n\n• Weekly direct deposit options\n• Free Private Furnished Housing or Tax-Free Subsidy\n• Dental benefits\n\nJoin Our Team\n\nIf you are passionate about delivering exceptional patient care and are looking for a new challenge, join our team at HealthTrust Workforce Solutions HCA today!",
    "url": "https://us.bebee.com/job/a7f6ab42b4d4a600ec308179edf1312c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Tech - Radiology",
    "company": "UCHealth",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-03T00:00:00.000Z",
    "description": "Description\n\nLocation: UCHealth UCHlth Cherry Creek Med Ctr, US:CO:Denver\n\nDepartment: UIS Cherry Creek Ct\n\nFTE: PRN, 0.0, 0.00 hours per pay period (2 weeks)\n\nShift: Days\n\nPay: $36.19 - $54.28 / hour. Pay is dependent on applicant's relevant experience\n\nMinimum Requirements:\n• Graduate of an accredited Radiologic Technologist program.\n• Registered as a Radiologic Technologist (RT) and registered, and or registry eligible with completion of registry in 12 months in computed tomography (CT) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n• BLS - BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\n\nAt UCHealth, We Improve Lives\n\nPicture yourself on a dynamic team improving lives in the following way(s):\n• Provides top of scope practice in direct patient care\n• Values a multidisciplinary team approach to achieve exceptional outcomes\n• Models proficiency through precepting those new to UCHealth\n• Welcomes new knowledge in a fast paced, innovative clinical environment\n• Contributes to secure safety and quality at the point of care\n\nCT Tech:\n• Reviews patient history, initiates Computed Tomography images based on physician order and prioritizes procedural patient education to ensure mutual understanding and cooperation\n• Safely administers contrast media or associated imaging medications while monitoring patient condition\n• Responds and reports changes in patient condition as appropriate\n• Implements techniques to yield clarity in image, quality control and equipment functionality based on established best practices in Radiology (ARRT)\n• May perform 3-D post processing while entering, transmitting and reporting scan results\n\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\n\nUCHealth invests in its Workforce.\n\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\n\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n• Medical, dental and vision coverage including coverage for eligible dependents\n• 403(b) with employer matching contributions\n• Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n• Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n• Employer paid short term disability and long-term disability with buy-up coverage options\n• Wellness benefits\n• Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n• Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\n• Loan Repayment: UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\n\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\n\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\n\nWho We Are (uchealth.org)\n\nSkills:\nAmerican Registry of Radiologic Technologists (ARRT), Basic Life Support (BLS), Best Practices, CPR Certification, Cell Biology, Click Through Rate (CTR), Computed Tomography (CAT Scan), Cross-Functional, Establish Priorities, Legal, Medications, Patient Care, Patient Education, Patient History, Quality Control, Radiology, Requirements Validation/Verification, Safety/Work Safety, Student Loans, Technical Leadership, User Interface/Experience (UI/UX)\n\nAbout the Company:\nUCHealth",
    "url": "https://www.monster.com/job-openings/ct-tech-radiology-denver-co--c854f92c-968e-4f81-b5c4-db9189d63548?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Lead - MRI Technologist - $41-62 per hour",
    "company": "UCHealth (Colorado)",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-02T00:00:00.000Z",
    "description": "UCHealth (Colorado) is seeking a MRI Technologist Lead for a job in Denver, Colorado.\nJob Description & Requirements\n• Specialty: MRI Technologist\n• Discipline: Allied Health Professional\n• Duration: Ongoing\n• 40 hours per week\n• Employment Type: Staff\n\nDescription\n\nLocation: UCHealth Cherry Creek MOB and ASC, US:CO:Denver\nDepartment: UIS Cherry Creek MRI\nFTE: Full Time, 1.0, 80.00 hours per pay period (2 weeks)\nShift: Days\nPay: $41.43 - $62.15 / hour. Pay is dependent on applicant's relevant experience\nMinimum Requirements:\n- Graduate of an accredited Radiologic Technologist program.\n- Registered as a Technologist (RT) and certified in magnetic resonance imaging (MRI) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n- Basic Life Support (BLS) Healthcare Provider; BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\n- 2 years of experience.\nAt UCHealth, We Improve Lives\nPicture yourself on a dynamic team improving lives in the following way(s):\n- Provides top of scope practice in direct patient care\n- Values a multidisciplinary team approach to achieve exceptional outcomes\n- Models proficiency through precepting those new to UCHealth\n- Welcomes new knowledge in a fast paced, innovative clinical environment\n- Contributes to secure safety and quality at the point of care\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\nUCHealth invests in its Workforce.\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n- Medical, dental and vision coverage including coverage for eligible dependents\n- 403(b) with employer matching contributions\n- Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n- Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n- Employer paid short term disability and long-term disability with buy-up coverage options\n- Wellness benefits\n- Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n- Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\nLoan Repayment:\n- UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\nWho We Are (uchealth.org)\n\nUCHealth (Colorado) Job ID #260707. Posted job title: Mri Technologist Lead\nAbout UCHealth (Colorado)\n\n30,000+ Employees. One Mission. At UCHealth, we're looking for those who are talented, inspired and up for a challenge -- those who don't shy away from big emotional investments and daily opportunities to improve lives. We welcome those who naturally gravitate toward our inclusive community that celebrates our differences, our individuality and our similarities. Here, we are dedicated to putting patients first, excellence and integrity. For those individuals called to join our team, we want you to find more than just a career here. We want you to make extraordinary possible.\n\nBenefits\n• Holiday Pay\n• Continuing Education\n• 403b retirement plan\n• Pet insurance\n• Sick pay\n• Wellness and fitness programs\n• Medical benefits\n• Dental benefits\n• Vision benefits\n• Benefits start day 1\n• Discount program\n\nSkills:\nAmerican Registry of Radiologic Technologists (ARRT), Basic Life Support (BLS), CPR Certification, Cross-Functional, Fitness, Health Plan, Healthcare Providers, Job Requisition Posting, Legal, Magnetic Resonance Imaging (MRI), Patient Care, Radiology, Requirements Validation/Verification, Retirement Plan, Safety/Work Safety, Student Loans, Technical Leadership\n\nAbout the Company:\nUCHealth (Colorado)",
    "url": "https://www.monster.com/job-openings/lead-mri-technologist-41-62-per-hour-denver-co--8e868007-95b1-4270-b839-e2bf03ad1174?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Staff - CT Technologist - UCHealth",
    "company": "UCHealth (Colorado)",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-02T00:00:00.000Z",
    "description": "UCHealth (Colorado) is seeking a CT Technologist for a job in Denver, Colorado.\nJob Description & Requirements\n• Specialty: CT Technologist\n• Discipline: Allied Health Professional\n• Duration: Ongoing\n• 40 hours per week\n• Employment Type: Staff\n\nDescription\n\nLocation: UCHealth UCHlth Cherry Creek Med Ctr, US:CO:Denver\nDepartment: UIS Cherry Creek Ct\nFTE: PRN, 0.0, 0.00 hours per pay period (2 weeks)\nShift: Days\nPay: $36.19 - $54.28 / hour. Pay is dependent on applicant's relevant experience\nMinimum Requirements:\n- Graduate of an accredited Radiologic Technologist program.\n- Registered as a Radiologic Technologist (RT) and registered, and or registry eligible with completion of registry in 12 months in computed tomography (CT) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n- BLS - BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\nAt UCHealth, We Improve Lives\nPicture yourself on a dynamic team improving lives in the following way(s):\n- Provides top of scope practice in direct patient care\n- Values a multidisciplinary team approach to achieve exceptional outcomes\n- Models proficiency through precepting those new to UCHealth\n- Welcomes new knowledge in a fast paced, innovative clinical environment\n- Contributes to secure safety and quality at the point of care\nCT Tech:\n- Reviews patient history, initiates Computed Tomography images based on physician order and prioritizes procedural patient education to ensure mutual understanding and cooperation\n- Safely administers contrast media or associated imaging medications while monitoring patient condition\n- Responds and reports changes in patient condition as appropriate\n- Implements techniques to yield clarity in image, quality control and equipment functionality based on established best practices in Radiology (ARRT)\n- May perform 3-D post processing while entering, transmitting and reporting scan results\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\nUCHealth invests in its Workforce.\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n- Medical, dental and vision coverage including coverage for eligible dependents\n- 403(b) with employer matching contributions\n- Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n- Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n- Employer paid short term disability and long-term disability with buy-up coverage options\n- Wellness benefits\n- Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n- Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\n- Loan Repayment: UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\nWho We Are (uchealth.org)\n\nUCHealth (Colorado) Job ID #264938. Posted job title: Ct Technologist\nAbout UCHealth (Colorado)\n\n30,000+ Employees. One Mission. At UCHealth, we're looking for those who are talented, inspired and up for a challenge -- those who don't shy away from big emotional investments and daily opportunities to improve lives. We welcome those who naturally gravitate toward our inclusive community that celebrates our differences, our individuality and our similarities. Here, we are dedicated to putting patients first, excellence and integrity. For those individuals called to join our team, we want you to find more than just a career here. We want you to make extraordinary possible.\n\nBenefits\n• Holiday Pay\n• Continuing Education\n• 403b retirement plan\n• Pet insurance\n• Sick pay\n• Wellness and fitness programs\n• Medical benefits\n• Dental benefits\n• Vision benefits\n• Benefits start day 1\n• Discount program\n\nSkills:\nAmerican Registry of Radiologic Technologists (ARRT), Basic Life Support (BLS), Best Practices, CPR Certification, Cell Biology, Computed Tomography (CAT Scan), Cross-Functional, Establish Priorities, Fitness, Health Plan, Legal, Medications, Patient Care, Patient Education, Patient History, Quality Control, Radiology, Requirements Validation/Verification, Retirement Plan, Safety/Work Safety, Student Loans\n\nAbout the Company:\nUCHealth (Colorado)",
    "url": "https://www.monster.com/job-openings/staff-ct-technologist-uchealth-denver-co--9dc8b481-467a-43f0-8b63-3ade80920ca2?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Staff - CT Technologist - UCHealth",
    "company": "UCHealth (Colorado)",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-02T00:00:00.000Z",
    "description": "UCHealth (Colorado) is seeking a CT Technologist for a job in Denver, Colorado.\nJob Description & Requirements\n• Specialty: CT Technologist\n• Discipline: Allied Health Professional\n• Duration: Ongoing\n• 40 hours per week\n• Employment Type: Staff\n\nDescription\n\nLocation: UCHealth UCHlth Cherry Creek Med Ctr, US:CO:Denver\nDepartment: UIS Cherry Creek Ct\nFTE: PRN, 0.0, 0.00 hours per pay period (2 weeks)\nShift: Days\nPay: $36.19 - $54.28 / hour. Pay is dependent on applicant's relevant experience\nMinimum Requirements:\n- Graduate of an accredited Radiologic Technologist program.\n- Registered as a Radiologic Technologist (RT) and registered, and or registry eligible with completion of registry in 12 months in computed tomography (CT) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n- BLS - BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\nAt UCHealth, We Improve Lives\nPicture yourself on a dynamic team improving lives in the following way(s):\n- Provides top of scope practice in direct patient care\n- Values a multidisciplinary team approach to achieve exceptional outcomes\n- Models proficiency through precepting those new to UCHealth\n- Welcomes new knowledge in a fast paced, innovative clinical environment\n- Contributes to secure safety and quality at the point of care\nCT Tech:\n- Reviews patient history, initiates Computed Tomography images based on physician order and prioritizes procedural patient education to ensure mutual understanding and cooperation\n- Safely administers contrast media or associated imaging medications while monitoring patient condition\n- Responds and reports changes in patient condition as appropriate\n- Implements techniques to yield clarity in image, quality control and equipment functionality based on established best practices in Radiology (ARRT)\n- May perform 3-D post processing while entering, transmitting and reporting scan results\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\nUCHealth invests in its Workforce.\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n- Medical, dental and vision coverage including coverage for eligible dependents\n- 403(b) with employer matching contributions\n- Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n- Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n- Employer paid short term disability and long-term disability with buy-up coverage options\n- Wellness benefits\n- Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n- Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\n- Loan Repayment: UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\nWho We Are (uchealth.org)\n\nUCHealth (Colorado) Job ID #264938. Posted job title: Ct Technologist\nAbout UCHealth (Colorado)\n\n30,000+ Employees. One Mission. At UCHealth, we're looking for those who are talented, inspired and up for a challenge -- those who don't shy away from big emotional investments and daily opportunities to improve lives. We welcome those who naturally gravitate toward our inclusive community that celebrates our differences, our individuality and our similarities. Here, we are dedicated to putting patients first, excellence and integrity. For those individuals called to join our team, we want you to find more than just a career here. We want you to make extraordinary possible.\n\nBenefits\n• Holiday Pay\n• Continuing Education\n• 403b retirement plan\n• Pet insurance\n• Sick pay\n• Wellness and fitness programs\n• Medical benefits\n• Dental benefits\n• Vision benefits\n• Benefits start day 1\n• Discount program\n\nSkills:\nAmerican Registry of Radiologic Technologists (ARRT), Basic Life Support (BLS), Best Practices, CPR Certification, Cell Biology, Computed Tomography (CAT Scan), Cross-Functional, Establish Priorities, Fitness, Health Plan, Legal, Medications, Patient Care, Patient Education, Patient History, Quality Control, Radiology, Requirements Validation/Verification, Retirement Plan, Safety/Work Safety, Student Loans\n\nAbout the Company:\nUCHealth (Colorado)",
    "url": "https://www.monster.com/job-openings/staff-ct-technologist-uchealth-denver-co--9dc8b481-467a-43f0-8b63-3ade80920ca2?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Staff - CT Technologist - UCHealth",
    "company": "UCHealth (Colorado)",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-02T00:00:00.000Z",
    "description": "UCHealth (Colorado) is seeking a CT Technologist for a job in Denver, Colorado.\nJob Description & Requirements\n• Specialty: CT Technologist\n• Discipline: Allied Health Professional\n• Duration: Ongoing\n• 40 hours per week\n• Employment Type: Staff\n\nDescription\n\nLocation: UCHealth UCHlth Cherry Creek Med Ctr, US:CO:Denver\nDepartment: UIS Cherry Creek Ct\nFTE: PRN, 0.0, 0.00 hours per pay period (2 weeks)\nShift: Days\nPay: $36.19 - $54.28 / hour. Pay is dependent on applicant's relevant experience\nMinimum Requirements:\n- Graduate of an accredited Radiologic Technologist program.\n- Registered as a Radiologic Technologist (RT) and registered, and or registry eligible with completion of registry in 12 months in computed tomography (CT) by the American Registry of Radiologic Technologists (ARRT). State licensure if required by law.\n- BLS - BLS through the American Heart Association or the American Red Cross CPR for the Professional Rescuer with card in-hand before start date. BLS or CPR card must be good through sixty days of hire.\nAt UCHealth, We Improve Lives\nPicture yourself on a dynamic team improving lives in the following way(s):\n- Provides top of scope practice in direct patient care\n- Values a multidisciplinary team approach to achieve exceptional outcomes\n- Models proficiency through precepting those new to UCHealth\n- Welcomes new knowledge in a fast paced, innovative clinical environment\n- Contributes to secure safety and quality at the point of care\nCT Tech:\n- Reviews patient history, initiates Computed Tomography images based on physician order and prioritizes procedural patient education to ensure mutual understanding and cooperation\n- Safely administers contrast media or associated imaging medications while monitoring patient condition\n- Responds and reports changes in patient condition as appropriate\n- Implements techniques to yield clarity in image, quality control and equipment functionality based on established best practices in Radiology (ARRT)\n- May perform 3-D post processing while entering, transmitting and reporting scan results\nWe improve lives. In big ways through learning, healing, and discovery. In small, personal ways through human connection. But in all ways, we improve lives.\nUCHealth invests in its Workforce.\nUCHealth offers a Five Year Incentive Bonus to recognize employee's contributions to our success in quality, patient experience, organizational growth, financial goals, and tenure with UCHealth. The bonus accumulates annually each October and is paid out in October following completion of five years' employment.\nUCHealth offers their employees a competitive and comprehensive total rewards package:\n- Medical, dental and vision coverage including coverage for eligible dependents\n- 403(b) with employer matching contributions\n- Time away from work: paid time off (PTO), paid family and medical leave (inclusive of Colorado FAMLI), leaves of absence; start your employment at UCHealth with PTO in your bank\n- Employer-paid basic life and accidental death and dismemberment coverage with buy-up coverage options\n- Employer paid short term disability and long-term disability with buy-up coverage options\n- Wellness benefits\n- Full suite of voluntary benefits such as flexible spending accounts for health care and dependent care, health savings accounts (available with HD/HSA medical plan only), identity theft protection, pet insurance, and employee discount programs\n- Education benefits for employees, including the opportunity to be eligible for 100% of tuition, books and fees paid for by UCHealth for specific educational degrees. Other programs may qualify for up to $5,250 pre-paid by UCHealth or in the form of tuition reimbursement each calendar year\n- Loan Repayment: UCHealth is a qualifying employer for the federal Public Service Loan Forgiveness (PSLF) program! UCHealth provides employees with free assistance navigating the PSLF program to submit their federal student loans for forgiveness through Savi.\nUCHealth always welcomes talent. This position will be open for a minimum of three days and until a top applicant is identified.\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\nWho We Are (uchealth.org)\n\nUCHealth (Colorado) Job ID #264938. Posted job title: Ct Technologist\nAbout UCHealth (Colorado)\n\n30,000+ Employees. One Mission. At UCHealth, we're looking for those who are talented, inspired and up for a challenge -- those who don't shy away from big emotional investments and daily opportunities to improve lives. We welcome those who naturally gravitate toward our inclusive community that celebrates our differences, our individuality and our similarities. Here, we are dedicated to putting patients first, excellence and integrity. For those individuals called to join our team, we want you to find more than just a career here. We want you to make extraordinary possible.\n\nBenefits\n• Holiday Pay\n• Continuing Education\n• 403b retirement plan\n• Pet insurance\n• Sick pay\n• Wellness and fitness programs\n• Medical benefits\n• Dental benefits\n• Vision benefits\n• Benefits start day 1\n• Discount program\n\nSkills:\nAmerican Registry of Radiologic Technologists (ARRT), Basic Life Support (BLS), Best Practices, CPR Certification, Cell Biology, Computed Tomography (CAT Scan), Cross-Functional, Establish Priorities, Fitness, Health Plan, Legal, Medications, Patient Care, Patient Education, Patient History, Quality Control, Radiology, Requirements Validation/Verification, Retirement Plan, Safety/Work Safety, Student Loans\n\nAbout the Company:\nUCHealth (Colorado)",
    "url": "https://www.monster.com/job-openings/staff-ct-technologist-uchealth-denver-co--9dc8b481-467a-43f0-8b63-3ade80920ca2?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist - $47-59 per hour",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-02-01T00:00:00.000Z",
    "description": "Kaiser Permanente is seeking a MRI Technologist for a job in Denver, Colorado.\nJob Description & Requirements\n• Specialty: MRI Technologist\n• Discipline: Allied Health Professional\n• Duration: Ongoing\n• 40 hours per week\n• Shift: 8 hours, evenings\n• Employment Type: Staff\n\nSEIU Local 105 - $46.57 - $59.16\n\n“May be entitled to translation/bilingual, shift or other wage premiums as governed by the applicable collective bargaining agreement. Please refer to the respective collective bargaining agreement for additional information on such wage premiums:\n\nJob Summary:\n\nOperates magnetic resonance imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of MRI techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\n\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Instructs patient in preparing for examinations; explains, in a courteous manner, all procedures to be performed. Administers contrast media, as necessary, under direction of physician. Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy.\n• Operates MRI equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images according to radiologist designated protocols. Confers with Radiologist to establish requirements for non-standard examinations.\n• Operates and maintain image recording equipment, including computer, disk drives, image storage equipment and other devices. Processes and / or reformats images as required. Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/films used, identifying patient films, and tracking repeated films.\n• Monitors patient during sedation under direction of a physician and supervision of imaging RN. Maintains daily / monthly quality control of all MRI procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality.\n• Prepares and maintains MRI records and files, as required. Maintains daily log and enters statistics into computer. Compiles data and prepares reports in accordance with established guidelines.\n• Monitors and maintains inventory of supplies used in providing MRI services according to established guidelines. Maintains equipment and work area in a clean and orderly condition.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy. Exercises clinical judgment within scope of practice.\n• Performs other duties as required, to include assisting with scheduling member appointments.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.\n\nIn any materials you submit, you may redact or remove age-identifying information such as age, date of birth, or dates of school attendance or graduation. You will not be penalized for redacting or removing this information.\n\nKaiser Permanente Job ID #1324113. Posted job title: Mri Technologist\nAbout Kaiser Permanente\n\nAt the heart of health care, you'll find Kaiser Permanente. As the nations leading not-for-profit, integrated health plan, we make a difference in the lives of members, patients, and communities across the country.\n\nWith 39 hospitals and more than 734 locations in eight states and the District of Columbia, we proudly serve more than 12.7 million members from coast to coast. Whether you choose to join a hospital in the Northwest, a clinic in Southern California, or a medical office in the Mid-Atlantic, we have many opportunities for you to shape the future of care.\n\nOur teams are empowered to advance impactful and extraordinary care for all by pioneering health outcomes, encouraging diverse viewpoints, and creating new opportunities for learning and advancement. This covers more than our members and our employees; it also reaches far into our communities. Together, we're proudly working as one for a healthier today and tomorrow.\n\nWhy Vivian Health?\n\nBe sure to apply via Vivian Health to increase your chances of landing your perfect job. Just complete your Vivian Health profileonce, and get access to thousands of opportunities across the country. Then keep up to date with your job application process and conversations with our easy to use app.",
    "url": "https://www.vivian.com/job/9741-1324113/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-30T00:00:00.000Z",
    "description": "SEIU Local 105 - $46.57 - $59.16\n\n“May be entitled to translation/bilingual, shift or other wage premiums as governed by the applicable collective bargaining agreement. Please refer to the respective collective bargaining agreement for additional information on such wage premiums: https://www.lmpartnership.org/local-contracts.\n\nJob Summary:\n\nOperates magnetic resonance imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of MRI techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\n\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Instructs patient in preparing for examinations; explains, in a courteous manner, all procedures to be performed. Administers contrast media, as necessary, under direction of physician. Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy.\n• Operates MRI equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images according to radiologist designated protocols. Confers with Radiologist to establish requirements for non-standard examinations.\n• Operates and maintain image recording equipment, including computer, disk drives, image storage equipment and other devices. Processes and / or reformats images as required. Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/films used, identifying patient films, and tracking repeated films.\n• Monitors patient during sedation under direction of a physician and supervision of imaging RN. Maintains daily / monthly quality control of all MRI procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality.\n• Prepares and maintains MRI records and files, as required. Maintains daily log and enters statistics into computer. Compiles data and prepares reports in accordance with established guidelines.\n• Monitors and maintains inventory of supplies used in providing MRI services according to established guidelines. Maintains equipment and work area in a clean and orderly condition.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy. Exercises clinical judgment within scope of practice.\n• Performs other duties as required, to include assisting with scheduling member appointments.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.",
    "url": "https://www.kaiserpermanentejobs.org/job/denver/mri-technologist/641/76780251072?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-30T00:00:00.000Z",
    "description": "SEIU Local 105 - $46.57 - $59.16\n\n“May be entitled to translation/bilingual, shift or other wage premiums as governed by the applicable collective bargaining agreement. Please refer to the respective collective bargaining agreement for additional information on such wage premiums: https://www.lmpartnership.org/local-contracts.\n\nJob Summary:\n\nOperates magnetic resonance imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of MRI techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\n\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Instructs patient in preparing for examinations; explains, in a courteous manner, all procedures to be performed. Administers contrast media, as necessary, under direction of physician. Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy.\n• Operates MRI equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images according to radiologist designated protocols. Confers with Radiologist to establish requirements for non-standard examinations.\n• Operates and maintain image recording equipment, including computer, disk drives, image storage equipment and other devices. Processes and / or reformats images as required. Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/films used, identifying patient films, and tracking repeated films.\n• Monitors patient during sedation under direction of a physician and supervision of imaging RN. Maintains daily / monthly quality control of all MRI procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality.\n• Prepares and maintains MRI records and files, as required. Maintains daily log and enters statistics into computer. Compiles data and prepares reports in accordance with established guidelines.\n• Monitors and maintains inventory of supplies used in providing MRI services according to established guidelines. Maintains equipment and work area in a clean and orderly condition.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy. Exercises clinical judgment within scope of practice.\n• Performs other duties as required, to include assisting with scheduling member appointments.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.",
    "url": "https://www.kaiserpermanentejobs.org/job/denver/mri-technologist/641/76780251072?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Technologist",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-30T00:00:00.000Z",
    "description": "SEIU Local 105 - $46.57 - $59.16\n\n“May be entitled to translation/bilingual, shift or other wage premiums as governed by the applicable collective bargaining agreement. Please refer to the respective collective bargaining agreement for additional information on such wage premiums: https://www.lmpartnership.org/local-contracts.\n\nJob Summary:\n\nOperates magnetic resonance imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of MRI techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\n\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Instructs patient in preparing for examinations; explains, in a courteous manner, all procedures to be performed. Administers contrast media, as necessary, under direction of physician. Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy.\n• Operates MRI equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images according to radiologist designated protocols. Confers with Radiologist to establish requirements for non-standard examinations.\n• Operates and maintain image recording equipment, including computer, disk drives, image storage equipment and other devices. Processes and / or reformats images as required. Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/films used, identifying patient films, and tracking repeated films.\n• Monitors patient during sedation under direction of a physician and supervision of imaging RN. Maintains daily / monthly quality control of all MRI procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality.\n• Prepares and maintains MRI records and files, as required. Maintains daily log and enters statistics into computer. Compiles data and prepares reports in accordance with established guidelines.\n• Monitors and maintains inventory of supplies used in providing MRI services according to established guidelines. Maintains equipment and work area in a clean and orderly condition.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy. Exercises clinical judgment within scope of practice.\n• Performs other duties as required, to include assisting with scheduling member appointments.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.",
    "url": "https://www.kaiserpermanentejobs.org/job/denver/mri-technologist/641/76780251072?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist",
    "company": "HCA Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-28T00:00:00.000Z",
    "description": "Description\nHourly Wage Estimate: 33.10 - 50.75 / hour\nLearn more about the benefits offered for this job.\n\nThe estimate displayed represents the typical wage range of candidates hired. Factors that may be used to determine your actual salary may include your specific skills, how many years of experience you have and comparison to other employees already in this role. The typical candidate is hired below midpoint of the range.\n• Position is weekends: Fri, Sat, Sun 7:00p - 7:30a\n\nGenerous sign-on and relo bonuses available!\n\nBonus eligibility limited to candidates not currently employed by HCA HealthONE\n• Additional 6.25/hr. differential PLUS night shift differential of 5.50/hr. for all hours worked!\n\nAre you looking for a work environment where diversity and inclusion thrive? Submit your application for our CT Technologist opening with HCA HealthONE Presbyterian/St. Luke’s today and find out what it truly means to be a part of the HCA Healthcare team.\nBenefits\n\nHCA HealthONE Presbyterian/St. Luke’s, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include:\n• Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation.\n• Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more.\n• Free counseling services and resources for emotional, physical and financial wellbeing\n• 401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)\n• Employee Stock Purchase Plan with 10% off HCA Healthcare stock\n• Family support through fertility and family building benefits with Progyny and adoption assistance.\n• Referral services for child, elder and pet care, home and auto repair, event planning and more\n• Consumer discounts through Abenity and Consumer Discounts\n• Retirement readiness, rollover assistance services and preferred banking partnerships\n• Education assistance (tuition, student loan, certification support, dependent scholarships)\n• Colleague recognition program\n• Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)\n• Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income.\n\nLearn more about Employee Benefits\n\nNote: Eligibility for benefits may vary by location.\n\nWe are seeking a(an) CT Technologist for our team to ensure that we continue to provide all patients with high quality, efficient care. Did you get into our industry for these reasons? We are an amazing team that works hard to support each other and are seeking a phenomenal addition like you who feels patient care is as meaningful as we do. We want you to apply!\nJob Summary and Qualifications\n\nCat Scan Technologists use computerized tomography (CT) scanners to produce cross-section images of patients’ internal organs and tissues for the diagnosis of medical issues. A CT Technologist must be able to accurately interpret a physician’s scanning instructions, administer contrast materials, prepare and operate the CT scan equipment, and position the patient to capture the appropriate images. Here is some of what to expect as a CT Tech with us:\n\nYour role is responsible for solid to expert knowledge of all CT procedures.\n\nYou will communicate and work independently in performing all CT procedures on customers ranging in age from newborn to late adulthood.\n\nYour role uses computed tomography equipment to take images of a patient’s body from different angles.\n\nYou will prepare patients for radiological procedure by positioning patient; adjusting immobilization devices; moving equipment into specified position; adjusting equipment controls to set exposure factors.\n\nYour role positively reflects concern and consideration when interacting with patients, medical staff, and employees.\n\nWhat qualifications you will need:\n• Graduate of 24-month AMA approved school of Radiologic Technology - Certified by ARRT.\n• ARRT(RT)(CT) REQUIRED and CE compliance & Current BLS certification required.\n• 1 year diagnostic experience required. CT experience preferred.\n• Solid to expert knowledge of all CT procedures.\n• Basic Cardiac Life Support must be obtained within 30 days of employment start date\n• Vocational School Graduate\n\nHCA HealthONE, one of the largest and most comprehensive healthcare systems in the Rocky Mountain region, offers more than 170 care sites in the Denver-metro area. Offering services across the continuum of care to meet patients’ total healthcare needs, HCA HealthONE includes seven acute care hospitals, a dedicated flagship pediatric hospital, a rehabilitation hospital, CareNow® urgent care clinics, mental health campuses, imaging and surgery centers, physician practices, home and hospice care, and AirLife Denver, which provides regional critical care air and ground transportation.\n\nAmong HCA HealthONE’s acute care hospitals is Presbyterian/St. Luke’s (P/SL). P/SL has been meeting the healthcare needs of patients and their families from across the Rocky Mountain region for more than 140 years. Included on the P/SL campus is Rocky Mountain Children’s, a dedicated pediatric hospital, making the campus the only tertiary/quaternary combined pediatric and adult hospital in this region. P/SL is home to an awarding winning cancer program including the Colorado Blood Cancer Institute, a solid organ transplant program, and complex orthopedics. Consistently among the Denver Business Journals’ list of top corporate philanthropists in the Denver-metro area, HCA HealthONE was named as one of the most community-minded organizations by The Civic 50 and contributed more than 1 million through cash and in-kind donations last year alone, along with more than 400M in federal, state and local taxes.\n\nHCA Healthcare has been recognized as one of the Worlds Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated 3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.\n\n\"Across HCA Healthcare’s more than 2,000 sites of care, our nurses and colleagues have a positive impact on patients, communities and healthcare.\nTogether, we uplift and elevate our purpose to give people a healthier tomorrow.\"- Jane Englebright, PhD, RN CENP, FAAN\nSenior Vice President and Chief Nursing Executive\n\nIf you find this opportunity compelling, we encourage you to apply for our CT Technologist opening. We promptly review all applications. Highly qualified candidates will be directly contacted by a member of our team. We are interviewing apply today!\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "url": "https://careers.hcahealthcare.com/jobs/14618530-ct-technologist?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist",
    "company": "HCA Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-28T00:00:00.000Z",
    "description": "Description\nHourly Wage Estimate: 33.10 - 50.75 / hour\nLearn more about the benefits offered for this job.\n\nThe estimate displayed represents the typical wage range of candidates hired. Factors that may be used to determine your actual salary may include your specific skills, how many years of experience you have and comparison to other employees already in this role. The typical candidate is hired below midpoint of the range.\n• Position is weekends: Fri, Sat, Sun 7:00p - 7:30a\n\nGenerous sign-on and relo bonuses available!\n\nBonus eligibility limited to candidates not currently employed by HCA HealthONE\n• Additional 6.25/hr. differential PLUS night shift differential of 5.50/hr. for all hours worked!\n\nAre you looking for a work environment where diversity and inclusion thrive? Submit your application for our CT Technologist opening with HCA HealthONE Presbyterian/St. Luke’s today and find out what it truly means to be a part of the HCA Healthcare team.\nBenefits\n\nHCA HealthONE Presbyterian/St. Luke’s, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include:\n• Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation.\n• Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more.\n• Free counseling services and resources for emotional, physical and financial wellbeing\n• 401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)\n• Employee Stock Purchase Plan with 10% off HCA Healthcare stock\n• Family support through fertility and family building benefits with Progyny and adoption assistance.\n• Referral services for child, elder and pet care, home and auto repair, event planning and more\n• Consumer discounts through Abenity and Consumer Discounts\n• Retirement readiness, rollover assistance services and preferred banking partnerships\n• Education assistance (tuition, student loan, certification support, dependent scholarships)\n• Colleague recognition program\n• Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)\n• Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income.\n\nLearn more about Employee Benefits\n\nNote: Eligibility for benefits may vary by location.\n\nWe are seeking a(an) CT Technologist for our team to ensure that we continue to provide all patients with high quality, efficient care. Did you get into our industry for these reasons? We are an amazing team that works hard to support each other and are seeking a phenomenal addition like you who feels patient care is as meaningful as we do. We want you to apply!\nJob Summary and Qualifications\n\nCat Scan Technologists use computerized tomography (CT) scanners to produce cross-section images of patients’ internal organs and tissues for the diagnosis of medical issues. A CT Technologist must be able to accurately interpret a physician’s scanning instructions, administer contrast materials, prepare and operate the CT scan equipment, and position the patient to capture the appropriate images. Here is some of what to expect as a CT Tech with us:\n\nYour role is responsible for solid to expert knowledge of all CT procedures.\n\nYou will communicate and work independently in performing all CT procedures on customers ranging in age from newborn to late adulthood.\n\nYour role uses computed tomography equipment to take images of a patient’s body from different angles.\n\nYou will prepare patients for radiological procedure by positioning patient; adjusting immobilization devices; moving equipment into specified position; adjusting equipment controls to set exposure factors.\n\nYour role positively reflects concern and consideration when interacting with patients, medical staff, and employees.\n\nWhat qualifications you will need:\n• Graduate of 24-month AMA approved school of Radiologic Technology - Certified by ARRT.\n• ARRT(RT)(CT) REQUIRED and CE compliance & Current BLS certification required.\n• 1 year diagnostic experience required. CT experience preferred.\n• Solid to expert knowledge of all CT procedures.\n• Basic Cardiac Life Support must be obtained within 30 days of employment start date\n• Vocational School Graduate\n\nHCA HealthONE, one of the largest and most comprehensive healthcare systems in the Rocky Mountain region, offers more than 170 care sites in the Denver-metro area. Offering services across the continuum of care to meet patients’ total healthcare needs, HCA HealthONE includes seven acute care hospitals, a dedicated flagship pediatric hospital, a rehabilitation hospital, CareNow® urgent care clinics, mental health campuses, imaging and surgery centers, physician practices, home and hospice care, and AirLife Denver, which provides regional critical care air and ground transportation.\n\nAmong HCA HealthONE’s acute care hospitals is Presbyterian/St. Luke’s (P/SL). P/SL has been meeting the healthcare needs of patients and their families from across the Rocky Mountain region for more than 140 years. Included on the P/SL campus is Rocky Mountain Children’s, a dedicated pediatric hospital, making the campus the only tertiary/quaternary combined pediatric and adult hospital in this region. P/SL is home to an awarding winning cancer program including the Colorado Blood Cancer Institute, a solid organ transplant program, and complex orthopedics. Consistently among the Denver Business Journals’ list of top corporate philanthropists in the Denver-metro area, HCA HealthONE was named as one of the most community-minded organizations by The Civic 50 and contributed more than 1 million through cash and in-kind donations last year alone, along with more than 400M in federal, state and local taxes.\n\nHCA Healthcare has been recognized as one of the Worlds Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated 3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.\n\n\"Across HCA Healthcare’s more than 2,000 sites of care, our nurses and colleagues have a positive impact on patients, communities and healthcare.\nTogether, we uplift and elevate our purpose to give people a healthier tomorrow.\"- Jane Englebright, PhD, RN CENP, FAAN\nSenior Vice President and Chief Nursing Executive\n\nIf you find this opportunity compelling, we encourage you to apply for our CT Technologist opening. We promptly review all applications. Highly qualified candidates will be directly contacted by a member of our team. We are interviewing apply today!\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "url": "https://careers.hcahealthcare.com/jobs/14618530-ct-technologist?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist",
    "company": "HCA Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-28T00:00:00.000Z",
    "description": "Description\nHourly Wage Estimate: 33.10 - 50.75 / hour\nLearn more about the benefits offered for this job.\n\nThe estimate displayed represents the typical wage range of candidates hired. Factors that may be used to determine your actual salary may include your specific skills, how many years of experience you have and comparison to other employees already in this role. The typical candidate is hired below midpoint of the range.\n• Position is weekends: Fri, Sat, Sun 7:00p - 7:30a\n\nGenerous sign-on and relo bonuses available!\n\nBonus eligibility limited to candidates not currently employed by HCA HealthONE\n• Additional 6.25/hr. differential PLUS night shift differential of 5.50/hr. for all hours worked!\n\nAre you looking for a work environment where diversity and inclusion thrive? Submit your application for our CT Technologist opening with HCA HealthONE Presbyterian/St. Luke’s today and find out what it truly means to be a part of the HCA Healthcare team.\nBenefits\n\nHCA HealthONE Presbyterian/St. Luke’s, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include:\n• Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation.\n• Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more.\n• Free counseling services and resources for emotional, physical and financial wellbeing\n• 401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)\n• Employee Stock Purchase Plan with 10% off HCA Healthcare stock\n• Family support through fertility and family building benefits with Progyny and adoption assistance.\n• Referral services for child, elder and pet care, home and auto repair, event planning and more\n• Consumer discounts through Abenity and Consumer Discounts\n• Retirement readiness, rollover assistance services and preferred banking partnerships\n• Education assistance (tuition, student loan, certification support, dependent scholarships)\n• Colleague recognition program\n• Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)\n• Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income.\n\nLearn more about Employee Benefits\n\nNote: Eligibility for benefits may vary by location.\n\nWe are seeking a(an) CT Technologist for our team to ensure that we continue to provide all patients with high quality, efficient care. Did you get into our industry for these reasons? We are an amazing team that works hard to support each other and are seeking a phenomenal addition like you who feels patient care is as meaningful as we do. We want you to apply!\nJob Summary and Qualifications\n\nCat Scan Technologists use computerized tomography (CT) scanners to produce cross-section images of patients’ internal organs and tissues for the diagnosis of medical issues. A CT Technologist must be able to accurately interpret a physician’s scanning instructions, administer contrast materials, prepare and operate the CT scan equipment, and position the patient to capture the appropriate images. Here is some of what to expect as a CT Tech with us:\n\nYour role is responsible for solid to expert knowledge of all CT procedures.\n\nYou will communicate and work independently in performing all CT procedures on customers ranging in age from newborn to late adulthood.\n\nYour role uses computed tomography equipment to take images of a patient’s body from different angles.\n\nYou will prepare patients for radiological procedure by positioning patient; adjusting immobilization devices; moving equipment into specified position; adjusting equipment controls to set exposure factors.\n\nYour role positively reflects concern and consideration when interacting with patients, medical staff, and employees.\n\nWhat qualifications you will need:\n• Graduate of 24-month AMA approved school of Radiologic Technology - Certified by ARRT.\n• ARRT(RT)(CT) REQUIRED and CE compliance & Current BLS certification required.\n• 1 year diagnostic experience required. CT experience preferred.\n• Solid to expert knowledge of all CT procedures.\n• Basic Cardiac Life Support must be obtained within 30 days of employment start date\n• Vocational School Graduate\n\nHCA HealthONE, one of the largest and most comprehensive healthcare systems in the Rocky Mountain region, offers more than 170 care sites in the Denver-metro area. Offering services across the continuum of care to meet patients’ total healthcare needs, HCA HealthONE includes seven acute care hospitals, a dedicated flagship pediatric hospital, a rehabilitation hospital, CareNow® urgent care clinics, mental health campuses, imaging and surgery centers, physician practices, home and hospice care, and AirLife Denver, which provides regional critical care air and ground transportation.\n\nAmong HCA HealthONE’s acute care hospitals is Presbyterian/St. Luke’s (P/SL). P/SL has been meeting the healthcare needs of patients and their families from across the Rocky Mountain region for more than 140 years. Included on the P/SL campus is Rocky Mountain Children’s, a dedicated pediatric hospital, making the campus the only tertiary/quaternary combined pediatric and adult hospital in this region. P/SL is home to an awarding winning cancer program including the Colorado Blood Cancer Institute, a solid organ transplant program, and complex orthopedics. Consistently among the Denver Business Journals’ list of top corporate philanthropists in the Denver-metro area, HCA HealthONE was named as one of the most community-minded organizations by The Civic 50 and contributed more than 1 million through cash and in-kind donations last year alone, along with more than 400M in federal, state and local taxes.\n\nHCA Healthcare has been recognized as one of the Worlds Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated 3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.\n\n\"Across HCA Healthcare’s more than 2,000 sites of care, our nurses and colleagues have a positive impact on patients, communities and healthcare.\nTogether, we uplift and elevate our purpose to give people a healthier tomorrow.\"- Jane Englebright, PhD, RN CENP, FAAN\nSenior Vice President and Chief Nursing Executive\n\nIf you find this opportunity compelling, we encourage you to apply for our CT Technologist opening. We promptly review all applications. Highly qualified candidates will be directly contacted by a member of our team. We are interviewing apply today!\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "url": "https://careers.hcahealthcare.com/jobs/14618530-ct-technologist?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist",
    "company": "Intermountain Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-27T00:00:00.000Z",
    "description": "Job Description:\nThe CT Tech performs a variety of CT procedures using ionizing radiation for diagnostic purposes. This position uses ingenuity, iniative, and independent judgement to perform high quality scans.\n\nDiscover why Intermountain Health is a great place to work\n\nPosting Specifics:\n• Benefits Eligible: Yes\n• Hours: (36 hours)\n• Shift Details: Friday, Saturday, Sunday 2000-0630 (Weekend Nights)\n• Additional Details: Shift differentials given for evenings, nights and weekends\n\nSaint Joseph Hospital is part of Intermountain Health a nonprofit healthcare organization that focuses on person-centered care. Our 365-bed facility is one of the top-ranked hospitals in Denver and has been awarded the highest national recognition possible for nursing excellence - Magnet designation - by the ANCC. We are proud to extend the mission of Intermountain Health by providing care for the poor, the vulnerable, our communities and each other. Our deep community roots date back to 1873, making us one of the oldest hospitals in Colorado.\n\nBenefits are one of the ways we encourage health for you and your family. Our generous package includes medical, dental and vision coverage. But health is more than a well-working body: it encompasses body, mind and social well-being. To that end, we've launched a Healthy Living program to address your holistic health. Healthy Living includes financial incentives, digital tools, tobacco cessation, classes, counseling and Paid Time Off. We also offer financial wellness tools and retirement planning.\n\nScope:\n\nCT Technologist responsibilities:\n• Perform CT procedures in order to obtain desired imaging results according to physician's specifications that includes, but is not limited to: transferring patients for examinations, ionizing radiation for radiologic diagnosis, and assisting with the CT examination process\n• Be responsible for appropriate operation of all CT Imaging and related equipment.\n• Appropriately educate, position, immobilize and perform CT procedures.\n• Coordinate CT examination to ensure timeliness, quality, and continuity of patient care.\n• Understand and follow provider Imaging orders correctly.\n• Submit required images and related clinical information to the Radiologist for interpretation.\n• Appropriately evaluate image quality\n• Provide open, accurate, and responsive communication to patients, coworkers, Radiologists, and leadership.\n• Appropriately utilize, charge, and maintain department supplies.\n\nRequirements:\n• ARRT - American Registry of Radiologic Technologists ARRT (R) Upon Hire, Required\n• Certified Computed Tomography Technologist - American Registry of Radiography Technologists ARRT (R)(CT), Preferred\n• Basic Life Support Certification (BLS) within 60 days, Required\n• Licensure in state of practice as applicable, Upon Hire, Required\n• IV Competency within 90 Days, Required\n• For caregivers hired in this role in the State of Colorado, a Fluoroscopy certification, Preferred\n• Specific facility-based certification may also be required for this role. If this applies, each facility will define and manage compliance\n• 1-2 years Work Experience CT Experience in a hospital setting, Preferred\n\nNow that you know more about being a CT Technologist on our team, we hope you'll join us. At Intermountain Health, you'll reaffirm every day how much you love this work, and why you were called to it in the first place.\n\nPhysical Requirements:\n\nLocation:\nSaint Joseph Hospital\n\nWork City:\nDenver\n\nWork State:\nColorado\n\nScheduled Weekly Hours:\n36\n\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n$34.06 - $52.55\n\nWe care about your well-being - mind, body, and spirit - which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers.\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nAll positions subject to close without notice.",
    "url": "https://www.ziprecruiter.com/c/Intermountain-Healthcare/Job/CT-Technologist/-in-Denver,CO?jid=261f67e8da58d8e0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT TECH - WEEKENDS",
    "company": "Progeny HR Solutions LLC",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-27T00:00:00.000Z",
    "description": "JOB RESPONSIBILITIES-\n\nCT Tech\n\nCT TECH\n\nFull-Time\n\nCT Tech candidates will have the following job responsibilities:\n• Following established protocol and under the medical supervision of certified radiologists, CT technologists will produce computerized tomography scanner radiographs of designated anatomical areas as ordered/directed by the physician in order to interpret and diagnose patient disease or injury.\n• Technologists will assist the radiologists on procedures as needed and be responsible for supervision of student Radiologic Technologists assigned to them. Encourages and maintains good customer relations.\n\nJOB QUALIFICATIONS-\n\nCT Tech\n\nCT TECH\n\nFull-Time\n\nCT Tech candidates must meet the following minimum job qualifications:\n• Credential Requirements:\n• ARRT(RT)(CT) REQUIRED and CE compliance & Current BLS certification required.\n• Education Requirements:\n• Graduate of 24-month AMA approved school of Radiologic Technology - Certified by ARRT.\n• Experience Requirements:\n• 1 year diagnostic experience required. CT experience preferred.\n• Any Specific Licensures/Certifications Needed:\n• ARRT CT certified. BLS certified through AHA or ARC.\n• Hours (Multiple Openings):\n• Night Shifts:\n• 4-10's (Tuesday - Friday) 2030-0600\n• 3-10's (Monday - Thursday) 2030-0600\n• 3-12's (Friday - Sunday) 1800-1830\n• Evening Shifts:\n• 3-12's (Tuesday - Thursday) 1100-2330 -w- On-Call Saturday/Sunday Backup Call\n• Day Shift:\n• 4-10's (Tuesday-Friday) 0600-1630 -w- On-Call Saturday/Sunday Backup Call\n\nCompensation Range: $32.94 - $50.00\nShift Differentials: $2.00 Weekends & $5.50 Nights\n\n$20K Sign-On for Nights\n\n$10K Sign-On for Evenings",
    "url": "https://www.indeed.com/viewjob?jk=ee3984bb863ebad9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist",
    "company": "Intermountain Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-27T00:00:00.000Z",
    "description": "Job Description:\nThe CT Tech performs a variety of CT procedures using ionizing radiation for diagnostic purposes. This position uses ingenuity, iniative, and independent judgement to perform high quality scans.\n\nDiscover why Intermountain Health is a great place to work\n\nPosting Specifics:\n• Benefits Eligible: Yes\n• Hours: (36 hours)\n• Shift Details: Friday, Saturday, Sunday 2000-0630 (Weekend Nights)\n• Additional Details: Shift differentials given for evenings, nights and weekends\n\nSaint Joseph Hospital is part of Intermountain Health a nonprofit healthcare organization that focuses on person-centered care. Our 365-bed facility is one of the top-ranked hospitals in Denver and has been awarded the highest national recognition possible for nursing excellence - Magnet designation - by the ANCC. We are proud to extend the mission of Intermountain Health by providing care for the poor, the vulnerable, our communities and each other. Our deep community roots date back to 1873, making us one of the oldest hospitals in Colorado.\n\nBenefits are one of the ways we encourage health for you and your family. Our generous package includes medical, dental and vision coverage. But health is more than a well-working body: it encompasses body, mind and social well-being. To that end, we've launched a Healthy Living program to address your holistic health. Healthy Living includes financial incentives, digital tools, tobacco cessation, classes, counseling and Paid Time Off. We also offer financial wellness tools and retirement planning.\n\nScope:\n\nCT Technologist responsibilities:\n• Perform CT procedures in order to obtain desired imaging results according to physician's specifications that includes, but is not limited to: transferring patients for examinations, ionizing radiation for radiologic diagnosis, and assisting with the CT examination process\n• Be responsible for appropriate operation of all CT Imaging and related equipment.\n• Appropriately educate, position, immobilize and perform CT procedures.\n• Coordinate CT examination to ensure timeliness, quality, and continuity of patient care.\n• Understand and follow provider Imaging orders correctly.\n• Submit required images and related clinical information to the Radiologist for interpretation.\n• Appropriately evaluate image quality\n• Provide open, accurate, and responsive communication to patients, coworkers, Radiologists, and leadership.\n• Appropriately utilize, charge, and maintain department supplies.\n\nRequirements:\n• ARRT - American Registry of Radiologic Technologists ARRT (R) Upon Hire, Required\n• Certified Computed Tomography Technologist - American Registry of Radiography Technologists ARRT (R)(CT), Preferred\n• Basic Life Support Certification (BLS) within 60 days, Required\n• Licensure in state of practice as applicable, Upon Hire, Required\n• IV Competency within 90 Days, Required\n• For caregivers hired in this role in the State of Colorado, a Fluoroscopy certification, Preferred\n• Specific facility-based certification may also be required for this role. If this applies, each facility will define and manage compliance\n• 1-2 years Work Experience CT Experience in a hospital setting, Preferred\n\nNow that you know more about being a CT Technologist on our team, we hope you'll join us. At Intermountain Health, you'll reaffirm every day how much you love this work, and why you were called to it in the first place.\n\nPhysical Requirements:\n\nLocation:\nSaint Joseph Hospital\n\nWork City:\nDenver\n\nWork State:\nColorado\n\nScheduled Weekly Hours:\n36\n\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n$34.06 - $52.55\n\nWe care about your well-being - mind, body, and spirit - which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers.\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nAll positions subject to close without notice.",
    "url": "https://www.ziprecruiter.com/c/Intermountain-Healthcare/Job/CT-Technologist/-in-Denver,CO?jid=261f67e8da58d8e0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT TECH - WEEKENDS",
    "company": "Progeny HR Solutions LLC",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-27T00:00:00.000Z",
    "description": "JOB RESPONSIBILITIES-\n\nCT Tech\n\nCT TECH\n\nFull-Time\n\nCT Tech candidates will have the following job responsibilities:\n• Following established protocol and under the medical supervision of certified radiologists, CT technologists will produce computerized tomography scanner radiographs of designated anatomical areas as ordered/directed by the physician in order to interpret and diagnose patient disease or injury.\n• Technologists will assist the radiologists on procedures as needed and be responsible for supervision of student Radiologic Technologists assigned to them. Encourages and maintains good customer relations.\n\nJOB QUALIFICATIONS-\n\nCT Tech\n\nCT TECH\n\nFull-Time\n\nCT Tech candidates must meet the following minimum job qualifications:\n• Credential Requirements:\n• ARRT(RT)(CT) REQUIRED and CE compliance & Current BLS certification required.\n• Education Requirements:\n• Graduate of 24-month AMA approved school of Radiologic Technology - Certified by ARRT.\n• Experience Requirements:\n• 1 year diagnostic experience required. CT experience preferred.\n• Any Specific Licensures/Certifications Needed:\n• ARRT CT certified. BLS certified through AHA or ARC.\n• Hours (Multiple Openings):\n• Night Shifts:\n• 4-10's (Tuesday - Friday) 2030-0600\n• 3-10's (Monday - Thursday) 2030-0600\n• 3-12's (Friday - Sunday) 1800-1830\n• Evening Shifts:\n• 3-12's (Tuesday - Thursday) 1100-2330 -w- On-Call Saturday/Sunday Backup Call\n• Day Shift:\n• 4-10's (Tuesday-Friday) 0600-1630 -w- On-Call Saturday/Sunday Backup Call\n\nCompensation Range: $32.94 - $50.00\nShift Differentials: $2.00 Weekends & $5.50 Nights\n\n$20K Sign-On for Nights\n\n$10K Sign-On for Evenings",
    "url": "https://www.indeed.com/viewjob?jk=ee3984bb863ebad9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist",
    "company": "Intermountain Healthcare",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-27T00:00:00.000Z",
    "description": "Job Description:\nThe CT Tech performs a variety of CT procedures using ionizing radiation for diagnostic purposes. This position uses ingenuity, iniative, and independent judgement to perform high quality scans.\n\nDiscover why Intermountain Health is a great place to work\n\nPosting Specifics:\n• Benefits Eligible: Yes\n• Hours: (36 hours)\n• Shift Details: Friday, Saturday, Sunday 2000-0630 (Weekend Nights)\n• Additional Details: Shift differentials given for evenings, nights and weekends\n\nSaint Joseph Hospital is part of Intermountain Health a nonprofit healthcare organization that focuses on person-centered care. Our 365-bed facility is one of the top-ranked hospitals in Denver and has been awarded the highest national recognition possible for nursing excellence - Magnet designation - by the ANCC. We are proud to extend the mission of Intermountain Health by providing care for the poor, the vulnerable, our communities and each other. Our deep community roots date back to 1873, making us one of the oldest hospitals in Colorado.\n\nBenefits are one of the ways we encourage health for you and your family. Our generous package includes medical, dental and vision coverage. But health is more than a well-working body: it encompasses body, mind and social well-being. To that end, we've launched a Healthy Living program to address your holistic health. Healthy Living includes financial incentives, digital tools, tobacco cessation, classes, counseling and Paid Time Off. We also offer financial wellness tools and retirement planning.\n\nScope:\n\nCT Technologist responsibilities:\n• Perform CT procedures in order to obtain desired imaging results according to physician's specifications that includes, but is not limited to: transferring patients for examinations, ionizing radiation for radiologic diagnosis, and assisting with the CT examination process\n• Be responsible for appropriate operation of all CT Imaging and related equipment.\n• Appropriately educate, position, immobilize and perform CT procedures.\n• Coordinate CT examination to ensure timeliness, quality, and continuity of patient care.\n• Understand and follow provider Imaging orders correctly.\n• Submit required images and related clinical information to the Radiologist for interpretation.\n• Appropriately evaluate image quality\n• Provide open, accurate, and responsive communication to patients, coworkers, Radiologists, and leadership.\n• Appropriately utilize, charge, and maintain department supplies.\n\nRequirements:\n• ARRT - American Registry of Radiologic Technologists ARRT (R) Upon Hire, Required\n• Certified Computed Tomography Technologist - American Registry of Radiography Technologists ARRT (R)(CT), Preferred\n• Basic Life Support Certification (BLS) within 60 days, Required\n• Licensure in state of practice as applicable, Upon Hire, Required\n• IV Competency within 90 Days, Required\n• For caregivers hired in this role in the State of Colorado, a Fluoroscopy certification, Preferred\n• Specific facility-based certification may also be required for this role. If this applies, each facility will define and manage compliance\n• 1-2 years Work Experience CT Experience in a hospital setting, Preferred\n\nNow that you know more about being a CT Technologist on our team, we hope you'll join us. At Intermountain Health, you'll reaffirm every day how much you love this work, and why you were called to it in the first place.\n\nPhysical Requirements:\n\nLocation:\nSaint Joseph Hospital\n\nWork City:\nDenver\n\nWork State:\nColorado\n\nScheduled Weekly Hours:\n36\n\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n$34.06 - $52.55\n\nWe care about your well-being - mind, body, and spirit - which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers.\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nAll positions subject to close without notice.",
    "url": "https://www.ziprecruiter.com/c/Intermountain-Healthcare/Job/CT-Technologist/-in-Denver,CO?jid=261f67e8da58d8e0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT & MRI Radiologic Technologist",
    "company": "Kaiser Permanente",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-23T00:00:00.000Z",
    "description": "SEIU Local 105 - $47.00 - $59.71\n“May be entitled to translation/bilingual, shift or other wage premiums as governed by the applicable collective bargaining agreement. Please refer to the respective collective bargaining agreement for additional information on such wage premiums: https://www.lmpartnership.org/local-contracts.\n\nJob Summary:\n\nOperates computed tomography and magnetic resonance imaging scanners and related equipment to produce images of specified areas of the body, in accordance with the Radiologists instructions, using knowledge of CT/MRI techniques and procedures, sterile techniques, basic nursing procedures, patient care and monitoring, anatomical relationships and the contour and composition of body tissues. Makes members/patients and their needs a primary focus of ones actions; develops and sustains productive member/patient relationships. Actively seeks information to understand member/patient circumstances, problems, expectations, and needs. Builds rapport and cooperative relationship with members/patients. Considers how actions or plans will affect members; responds quickly to meet member/patient needs and resolves problems.\n\nEssential Responsibilities:\n• This position, knows and complies with all Kaiser Permanente quality, safety, and emergency policies and procedures. Demonstrates quality and effectiveness in work habits and clinical practice in every interaction with patients, colleagues, providers, and leadership. Ensures patient safety in the preparation and provisioning of care related to but not limited to medications, procedures, infection prevention, fall prevention, including consistent use of two patient identifiers and procedural time outs. Reports safety hazards, accidents and incidents, and unsafe working conditions promptly.\n• Instructs patient in preparing for examinations; explains, in a courteous manner, all procedures to be performed. Administers contrast media, as necessary, under direction of physician. Positions patient to obtain desired images in accordance with physicians instruction and using knowledge of human anatomy. Monitors patient during sedation under direction of a physician and supervision of Imaging RN.\n• Operates CT/MRI equipment to produce images of specified areas of the body, using knowledge of physiology and cross-sectional anatomy. Monitors images and makes necessary adjustments to obtain optimal images according to radiologist designated protocols. Confers with Radiologist to establish requirements for non-standard examinations.\n• Operates and maintain image recording equipment, including computer, disk drives, image storage equipment and other devices. Processes and / or reformats images as required. Consistently operates Radiology Information System to ensure accurate patient information by: tracking patient in/out of procedure room, tracking supplies/films used, identifying patient films, and tracking repeated films.\n• Maintains daily / monthly quality control of all CT/MRI procedures and related equipment by monitoring the operating condition of the equipment, and evaluating image quality. Maintains equipment and work area in a clean and orderly condition.\n• Prepares and maintains CT/MRI records and files, as required. Maintains daily log and enters statistics into computer. Compiles data and prepares reports in accordance with established guidelines. Monitors and maintains inventory of supplies used in providing CT/MRI services according to established guidelines.\n• Communicates clearly, effectively and appropriately at all times. Communicates verbally in a clear and concise manner. Demonstrates courteous and appropriate telephone skills. Communicates in writing accurately, completely and legibly, and routes such communication appropriately and in a timely manner.\n• Considers the cognitive, physical, emotional and chronological maturation process in delivery of services to patients in the age group served. Assesses data reflective of the patients status and interprets the appropriate information needed to identify each patients requirements relative to his or her age-specific needs, and provides the care needed in accordance with department policy. Exercises clinical judgment within scope of practice.\n• Performs other duties as required to include assisting with scheduling member appointments.\n• In addition to defined technical requirements, accountable for consistently demonstrating service behaviors and principles defined by the Kaiser Permanente Service Quality Credo, the KP Mission as well as specific departmental/organizational initiatives. Also accountable for consistently demonstrating the knowledge, skills, abilities, and behaviors necessary to provide superior and culturally sensitive service to each other, to our members, and to purchasers, contracted providers and vendors.",
    "url": "https://www.kaiserpermanentejobs.org/job/denver/ct-and-mri-radiologic-technologist/641/69926252992?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT Technologist II",
    "company": "Denver Health",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-23T00:00:00.000Z",
    "description": "We are recruiting for a motivated CT Technologist II to join our team!\n\nWe are here for life?s journey.\nWhere is your life journey taking you?\n\nBeing the heartbeat of Denver means our heart reflects something bigger than ourselves, something that connects us all:\n\nHumanity in action, Triumph in hardship, Transformation in health.\n\nDepartment\nCT Scan\n\nJob Summary\n\nUnder the direction of a radiologist, performs computed tomographic (CT) examinations at a technical level not requiring constant supervision. Performs a variety of technical imaging procedures that entail application of ionizing radiation; therefore, prudent judgment, strong technical skills, and commitment to patient safety are considered requisite professional characteristics for individuals assuming the position as a CT technologist.\n\nEssential Functions :\n• Achieve clinical competency within advanced imaging techniques of Computed Tomography\n? To include 3D Gout, 3D Cartilage, Cardiac Computed Tomography Angiography (CCTA)\n? Proficient in all clinical roles and competencies within Computed Tomography, perform any study as needed\n? Complete a par level of studies to ensure retention of clinical competencies\n(30%)\n• Maintain superuser status of Syngo and 3D reconstruction software.\n? Responsible for troubleshooting and utilizing Syngo independently\n? Responsible for performing 3D reconstructions from outside hospital imaging\n(25%)\n• Advanced IV placement\n? Utilize Ultrasound guidance for IV placement\n? Pediatric IV placement\n(10%)\n• Complete high level PACS duties\n? Assess and correct issues on the admins list within PACS\n? Assess and ensure reports are accurate and available in the appropriate location\n? Resolves and corrects real time issues that involve PACS\n(10%)\n• Leadership and team growth\n? Steps into leading others as needed\n? Assess and prioritize imaging needs within Computed Tomography\n? Educates the level I staff members to elevate them to level II clinical status\n? Directly supervises staff members in the cross training program\n(25%)\n\nEducation :\n• Associate's Degree Required\n\nWork Experience :\n• 1-3 years 1 year of professional work experience in performing CT imaging studies. Required\n\nLicenses :\n• BLS-Basic Life Support (BLS/CPR) - AHA - American Heart Association Required and\n• RTR-RT Radiography - ARRT - American Registry of Radiologic Technologists Required and\n• RTCT-RT Computed Tomography - ARRT - American Registry of Radiologic Technologists Required\n\nKnowledge, Skills and Abilities :\n• Demonstrated knowledge in how to operate CT equipment and related technology.\n• Knowledge of how to address age-specific care needs of patients.\n• Demonstrated technical skill sets in the performance of CT studies.\n• Demonstrable interpersonal skill sets that lead to effective communication and collaborations.\n• Competency in interpreting physician order requests for CT imaging studies.\n• Ability to exercise prudent judgment in selecting and configuring equipment settings to compensate for patient physiologic variances.\n• Ability to consistently produce quality images of various anatomical structures.\n\nShift\n\nWork Type\nRegular\n\nSalary\n$34.45 - $51.68 / hr\n\nBenefits\n• Outstanding benefits including up to 27 paid days off per year, immediate retirement plan employer contribution up to 9.5%, and generous medical plans\n• Free RTD EcoPass (public transportation)\n• On-site employee fitness center and wellness classes\n• Childcare discount programs & exclusive perks on large brands, travel, and more\n• Tuition reimbursement & assistance\n• Education & development opportunities including career pathways and coaching\n• Professional clinical advancement program & shared governance\n• Public Service Loan Forgiveness (PSLF) eligible employer+ free student loan coaching and assistance navigating the PSLF program\n• National Health Service Corps (NHCS) and Colorado Health Service Corps (CHSC) eligible employer\n\nOur Values\n• Respect\n• Belonging\n• Accountability\n• Transparency\n\nAll job applicants for safety-sensitive positions must pass a pre-employment drug test, once a conditional offer of employment has been made.\n\nDenver Health is an integrated, high-quality academic health care system considered a model for the nation that includes a Level I Trauma Center, a 555-bed acute care medical center, Denver?s 911 emergency medical response system, 10 family health centers, 19 school-based health centers, Rocky Mountain Poison & Drug Safety, a Public Health Institute, an HMO and The Denver Health Foundation.\n\nAs Colorado?s primary, and essential, safety-net institution, Denver Health is a mission-driven organization that has provided billions in uncompensated care for the uninsured. Denver Health is viewed as an Anchor Institution for the community, focusing on hiring and purchasing locally as applicable, serving as a pillar for community needs, and caring for more than 185,000 individuals and 67,000 children a year.\n\nLocated near downtown Denver, Denver Health is just minutes away from many of the cultural and recreational activities Denver has to offer.\n\nWe strongly support diversity in the workforce and Denver Health is an equal opportunity employer (EOE).\n\nDenver Health values the unique ideas, talents and contributions reflective of the needs of our community. For more about our commitment to diversity visit: https://www.denverhealth.org/for-professionals/careers/diversity-and-inclusion",
    "url": "https://jobboard.globalhealth.org/jobs/21004244/ct-technologist-ii?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "CT TECH",
    "company": "Next GenHealth Staffing",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-13T00:00:00.000Z",
    "description": "JOB RESPONSIBILITIES-\n\nCT Tech\n\nCT TECH\n\nFull-Time\n\nCT Tech candidates will have the following job responsibilities:\n• Following established protocol and under the medical supervision of certified radiologists, CT technologists will produce computerized tomography scanner radiographs of designated anatomical areas as ordered/directed by the physician in order to interpret and diagnose patient disease or injury.\n• Technologists will assist the radiologists on procedures as needed and be responsible for supervision of student Radiologic Technologists assigned to them. Encourages and maintains good customer relations.\n\nJOB QUALIFICATIONS-\n\nCT Tech\n\nCT TECH\n\nFull-Time\n\nCT Tech candidates must meet the following minimum job qualifications:\n• Credential Requirements:\n• ARRT(RT)(CT) REQUIRED and CE compliance & Current BLS certification required.\n• Education Requirements:\n• Graduate of 24-month AMA approved school of Radiologic Technology - Certified by ARRT.\n• Experience Requirements:\n• 1 year diagnostic experience required. CT experience preferred.\n• Any Specific Licensures/Certifications Needed:\n• ARRT CT certified. BLS certified through AHA or ARC.\n• Hours (Multiple Openings):\n• Night Shifts:\n• 4-10's (Tuesday - Friday) 2030-0600\n• 3-10's (Monday - Thursday) 2030-0600\n• 3-12's (Friday - Sunday) 1800-1830\n• Evening Shifts:\n• 3-12's (Tuesday - Thursday) 1100-2330 -w- On-Call Saturday/Sunday Backup Call\n• Day Shift:\n• 4-10's (Tuesday-Friday) 0600-1630 -w- On-Call Saturday/Sunday Backup Call\n\nCompensation Range: $32.94 - $50.00\n\nShift Differentials: $2.00 Weekends & $5.50 Nights\n\n$20K Sign-On for Nights\n\n$10K Sign-On for Evenings",
    "url": "https://www.indeed.com/viewjob?jk=88706195424c261d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "MRI Tech",
    "company": "St. Anthony Hospital",
    "location": "Denver, Colorado",
    "date_posted": "2025-01-08T00:00:00.000Z",
    "description": "Welcome to CommonSpirit Health Mountain Region:\n\nCommonSpirit Health Mountain Region is committed to building healthier communities, advocating for those who are poor and vulnerable, and innovating how and where healing can happen—both inside our hospitals and out in the community. With locations throughout Colorado, Utah, and Kansas, we deliver the same high standard of care to our employees as we do to our patients. Our 20 hospitals, emergency and urgent care centers, home care and hospice, Flight for Life Colorado TM , telehealth and over 240 physician practices and clinics offer endless opportunities! Here, you can grow your career and impact the people in the communities you serve.\n\nCommonSpirit Health is one of the nation’s largest nonprofit, faith-based health systems, with a team of over 150,000 employees and 25,000 physicians and advanced practice clinicians. CommonSpirit operates more than 2,200 care sites and 140 hospitals, serving some of the most diverse communities across the nation, letting humankindness lead the way.\n\nOverview:\n\nYou have a purpose, unique talents and NOW is the time to embrace it, live it and put it to work. We value incredible people with incredible skills – but your commitment to a greater cause is something we value even more.\n\nJoin our team as a MRI Tech. As a MRI Tech with us you will:\n• Provide quality patient care to all patients within the medical imaging department.\n• Perform high quality images and exams on patients while maintaining the sensitivity to patient needs.\n• Follow ACR practice guidelines and safety standards for MRI.\n• Demonstrate leadership abilities and is a role model for other associate technologists.\n• Act as a clinical resource to unit personnel and assures current standards of practice for the unit.\n\nSchedule: Monday - Thursday 9pm - 7:30am\n\nQualifications:\n\nIn addition to bringing your whole self to the workplace each day, qualified candidates will need the following:\n• High School Diploma or GED required\n• Registered Technologist, Radiology, Magnetic Resonance Imaging - R.T. (R)and/or(MR)(ARRT) required\n• Current Basic Life Support certification required from American Heart Association\n\nPhysical Requirements-Medium Work - (Exert up to 50lbs force occasionally, and/or up to 20lbs frequently, and/or up to 10lbs constantly)\n\nYour Connected Community:\n\nAt CommonSpirit Mountain Region, we believe in the healing power of humanity and serving the common good through our dedicated work and shared mission to celebrate humankindness.\n\nLocated in Lakewood, Colorado, St. Anthony Hospital is a Level I Trauma Center where we provide a full range of medical specialties and health care services to Denver and the surrounding region through our state-of-the-art medical campus and home base for Flight For Life® Colorado. With four trauma rooms including the T-10 room, a dedicated field-to-surgery suite ready 24/7 for trauma surgeons and specially trained teams, our staff can provide life-saving care to the most severely ill and injured patients. In 2023, we received our exciting Magnet® designation! We are so proud of our staff for this achievement, which is awarded to only 10 percent of hospitals around the world. Numerous other awards, certifications, and accreditations have been granted to us from the American Heart Association; Chest Pain Center (CPC); American College of Cardiology; The Joint Commission’s National Quality Approval; the Emergency Nurses Association Lantern Award; NAPBC Accreditation; American College of Radiology and many others.\n\nAt St. Anthony Hospital. we combine a heritage of expert care with the latest in technology and innovation. If you’re looking to be part of a fast-paced environment where you can practice to the top of your profession in trauma, cardiology, stroke, neurosciences, breast imaging, cancer/oncology care, surgery and more, we invite you to apply.\n\nOur Total Reward Offerings:\n\nBe sure to consider our generous benefits as part of your overall compensation! Designed with your well-being in mind, our benefits include:\n• Medical\n• Dental\n• Vision\n• 401K with generous match\n• Daycare FSA that can include a company contribution\n• Tuition Reimbursement\n• Student Loan Forgiveness and more!\n\nView more on our benefits HERE.\n\nPay Range:\n\n$36.50 - $61.47 / hour\n\nShift: Nights",
    "url": "https://www.ziprecruiter.com/c/St.-Anthony-Hospital/Job/MRI-Tech/-in-Denver,CO?jid=b91623992a2b8ada&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  }
]